gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
#include <errno.h>
#include <inttypes.h>
#include <math.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "cJSON.h"
#include "driver/gpio.h"
#include "driver/i2c_master.h"
#include "driver/i2s.h"
#include "esp_check.h"
#include "esp_event.h"
#include "esp_log.h"
#include "esp_netif.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "esp_wifi.h"
#include "esp_websocket_client.h"
#include "freertos/FreeRTOS.h"
#include "freertos/event_groups.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "lwip/netdb.h"
#include "nvs.h"
#include "nvs_flash.h"
#include "sdkconfig.h"
#include "soc/soc_caps.h"
#include "sys/socket.h"
#include "sys/time.h"
#include "unistd.h"

#include "intercom_protocol.h"
#include "pcm_frame_ring.h"

#ifndef CONFIG_INTERCOM_CLIENT_UID
#define CONFIG_INTERCOM_CLIENT_UID ""
#endif

#define WIFI_CONNECTED_BIT BIT0
#define MAX_CHANNELS 12
#define MAX_DIRECT_USERS 8
#define MAX_BUTTONS 4
#define MAX_BUTTON_ID 24
#define MAX_BUTTON_LABEL 32
#define CONTROL_SEND_TIMEOUT_MS 1000
#define CONTROL_SEND_MUTEX_TIMEOUT_MS 1500
#define CONTROL_RX_MAX_BYTES 16384
#define CONTROL_PING_INTERVAL_US 30000000LL
#define CONTROL_CAPTURE_HEALTH_SEND_INTERVAL_US 5000000LL
#define BUTTON_DEBOUNCE_US 30000
#define CAPTURE_HEALTH_REPORT_US 1000000
#define CAPTURE_CLIP_THRESHOLD 32600
#define CAPTURE_HIGH_PASS_ALPHA 0.995f
#define AUDIO_CUE_AMPLITUDE 1200.0f
#define AUDIO_CUE_PI 3.14159265358979323846f
#define AUDIO_CUE_SWITCH_RAMP_MS 24
#define AUDIO_CUE_RECONNECT_INTERVAL_US 4000000LL
#define AUDIO_CUE_SINE_LUT_SIZE 256
#define PLAYBACK_CODEC_MUTE_GATE_ENABLED 0
#define PLAYBACK_CODEC_ACTIVE_THRESHOLD 8
#define PLAYBACK_CODEC_UNMUTE_PREROLL_FRAMES 2
#define PLAYBACK_CODEC_IDLE_MUTE_FRAMES 3
#define PLAYBACK_STARTUP_SETTLE_MS 80
#define PLAYBACK_I2S_GAP_WARN_US (IC_FRAME_MS * 2500)
#define PLAYBACK_I2S_SLOW_WRITE_WARN_US (IC_FRAME_MS * 8000)
#define PLAYBACK_I2S_WARN_THROTTLE_US 1000000LL
#define ESP32_AUDIO_HW_SAMPLE_RATE IC_PCM48_SAMPLE_RATE
#define ESP32_AUDIO_HW_SAMPLES_PER_FRAME IC_PCM48_SAMPLES_PER_FRAME
#define ESP32_AUDIO_HW_CHANNELS 2
#define ESP32_AUDIO_HW_BITS_PER_SAMPLE 16
#define ESP32_AUDIO_HW_FRAME_BYTES (ESP32_AUDIO_HW_SAMPLES_PER_FRAME * ESP32_AUDIO_HW_CHANNELS * sizeof(int16_t))

#ifndef CONFIG_INTERCOM_SIDETONE_CODEC_BYPASS_GAIN_PERCENT
#define CONFIG_INTERCOM_SIDETONE_CODEC_BYPASS_GAIN_PERCENT 25
#endif

#ifndef CONFIG_INTERCOM_SIDETONE_MIC_BYPASS_GAIN_PERCENT
#define CONFIG_INTERCOM_SIDETONE_MIC_BYPASS_GAIN_PERCENT 100
#endif

#ifndef CONFIG_INTERCOM_NOTIFICATION_GAIN_PERCENT
#define CONFIG_INTERCOM_NOTIFICATION_GAIN_PERCENT 50
#endif

#ifndef CONFIG_INTERCOM_PLAYBACK_IDLE_FLOOR_ENABLED
#define CONFIG_INTERCOM_PLAYBACK_IDLE_FLOOR_ENABLED 1
#endif

#ifndef CONFIG_INTERCOM_PLAYBACK_IDLE_FLOOR_AMPLITUDE
#define CONFIG_INTERCOM_PLAYBACK_IDLE_FLOOR_AMPLITUDE 1
#endif

#ifndef CONFIG_INTERCOM_PLAYBACK_TASK_STACK_SIZE
#define CONFIG_INTERCOM_PLAYBACK_TASK_STACK_SIZE 6144
#endif

#ifndef CONFIG_INTERCOM_CAPTURE_TASK_STACK_SIZE
#define CONFIG_INTERCOM_CAPTURE_TASK_STACK_SIZE 6144
#endif

#ifndef CONFIG_INTERCOM_PLAYBACK_PREFILL_FRAMES
#define CONFIG_INTERCOM_PLAYBACK_PREFILL_FRAMES 2
#endif

#ifndef CONFIG_INTERCOM_AUDIO_TX_QUEUE_PACKETS
#define CONFIG_INTERCOM_AUDIO_TX_QUEUE_PACKETS 12
#endif

#ifndef CONFIG_INTERCOM_UDP_TASK_STACK_SIZE
#define CONFIG_INTERCOM_UDP_TASK_STACK_SIZE 8192
#endif

#define ES8388_ADDR 0x10
#define AC101_ADDR 0x1A
#define ES8388_CONTROL1 0x00
#define ES8388_CONTROL2 0x01
#define ES8388_CHIPPOWER 0x02
#define ES8388_ADCPOWER 0x03
#define ES8388_DACPOWER 0x04
#define ES8388_MASTERMODE 0x08
#define ES8388_ADCCONTROL1 0x09
#define ES8388_ADCCONTROL2 0x0A
#define ES8388_ADCCONTROL3 0x0B
#define ES8388_ADCCONTROL4 0x0C
#define ES8388_ADCCONTROL5 0x0D
#define ES8388_ADCCONTROL8 0x10
#define ES8388_ADCCONTROL9 0x11
#define ES8388_ADCCONTROL10 0x12
#define ES8388_ADCCONTROL11 0x13
#define ES8388_ADCCONTROL12 0x14
#define ES8388_ADCCONTROL13 0x15
#define ES8388_ADCCONTROL14 0x16
#define ES8388_DACCONTROL1 0x17
#define ES8388_DACCONTROL2 0x18
#define ES8388_DACCONTROL3 0x19
#define ES8388_DACCONTROL3_DAC_MUTE 0x04
#define ES8388_DACCONTROL4 0x1A
#define ES8388_DACCONTROL5 0x1B
#define ES8388_DACCONTROL16 0x26
#define ES8388_DACCONTROL17 0x27
#define ES8388_DACCONTROL18 0x28
#define ES8388_DACCONTROL19 0x29
#define ES8388_DACCONTROL20 0x2A
#define ES8388_DACCONTROL21 0x2B
#define ES8388_DACCONTROL23 0x2D
#define ES8388_DACCONTROL24 0x2E
#define ES8388_DACCONTROL25 0x2F
#define ES8388_DACCONTROL26 0x30
#define ES8388_DACCONTROL27 0x31
#define ES8388_DACPOWER_DISABLE_OUTPUTS 0xC0
#define ES8388_DACPOWER_ENABLE_ALL_OUTPUTS 0x3C
#define ES8388_DACPOWER_ENABLE_OUT1 0x0C
#define ES8388_DACPOWER_ENABLE_OUT2 0x30
#define ES8388_ADCPOWER_POWER_DOWN 0xFF
#define ES8388_ADCPOWER_ENABLE_ADC 0x09

#define ES8388_ADC_INPUT_LINE1 0x00
#define ES8388_ADC_INPUT_MIC1 0x05
#define ES8388_ADC_INPUT_MIC2 0x06
#define ES8388_ADC_INPUT_LINE2 0x50
#define ES8388_ADC_INPUT_DIFFERENCE 0xF0
#define ES8388_MIXER_DAC_0DB 0x90
#define ES8388_MIXER_DAC_AND_LINE_ENABLE 0x40
#define ES8388_DAC_LRCK_SHARED 0x80
#define ES8388_DAC_LRCK_SHARED_WITH_BYPASS 0xC0
#define ES8388_MIXSEL_LINE1 0x00
#define ES8388_MIXSEL_LINE2 0x09
#define ES8388_MIXSEL_ADC_P 0x1B
#define ES8388_MIXSEL_ADC_N 0x24
#define ES8388_OUTPUT_VOLUME_0DB 0x1E
#define ES8388_OUTPUT_VOLUME_PLUS_1_5DB 0x1F
#define ES8388_OUTPUT_VOLUME_PLUS_3DB 0x20
#define ES8388_OUTPUT_VOLUME_PLUS_4_5DB 0x21
#define ES8388_OUTPUT_VOLUME_MUTE 0x00

static const char *TAG = "intercom_esp32";

typedef enum {
    TALK_MODE_MUTED,
    TALK_MODE_PTT,
    TALK_MODE_OPEN,
} talk_mode_t;

typedef struct {
    uint16_t values[MAX_CHANNELS];
    size_t count;
} channel_list_t;

typedef struct {
    uint16_t values[MAX_DIRECT_USERS];
    size_t count;
} user_list_t;

typedef struct {
    char id[MAX_BUTTON_ID];
    char label[MAX_BUTTON_LABEL];
    bool latching;
    bool active;
    bool duck;
    channel_list_t tx_channels;
    user_list_t tx_users;
} button_route_t;

