gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
typedef struct {
    channel_list_t listen;
    channel_list_t tx;
    ic_codec_t codec;
    talk_mode_t talk_mode;
    bool regular_talk_active;
    button_route_t buttons[MAX_BUTTONS];
    size_t button_count;
} runtime_config_t;

typedef struct {
    ic_target_kind_t kind;
    uint16_t id;
} tx_target_t;

typedef struct {
    int gpio;
    const char *id;
    const char *label;
    bool stable_pressed;
    bool last_raw_pressed;
    int64_t last_change_us;
} physical_button_t;

typedef struct {
    double sum;
    double sum_squares;
    int peak_abs;
} capture_channel_accumulator_t;

typedef struct {
    capture_channel_accumulator_t left;
    capture_channel_accumulator_t right;
    capture_channel_accumulator_t selected;
    uint32_t samples;
    uint32_t raw_clipped_samples;
    uint32_t software_clipped_samples;
    uint16_t tx_target_count;
    uint32_t tx_packets_sent;
    uint32_t tx_send_failures;
    int64_t started_us;
} capture_health_accumulator_t;

typedef struct {
    float left_rms;
    float left_peak;
    float left_dc_offset;
    float right_rms;
    float right_peak;
    float right_dc_offset;
    float selected_rms;
    float selected_peak;
    float selected_dc_offset;
    uint32_t raw_clipped_samples;
    uint32_t software_clipped_samples;
    uint16_t tx_target_count;
    uint32_t tx_packets_sent;
    uint32_t tx_send_failures;
    bool ready;
} capture_health_report_t;

typedef enum {
    AUDIO_CUE_NONE,
    AUDIO_CUE_CONNECTED,
    AUDIO_CUE_DISCONNECTED,
    AUDIO_CUE_RECONNECTING,
} audio_cue_kind_t;

typedef struct {
    audio_cue_kind_t kind;
    audio_cue_kind_t pending_kind;
    uint32_t sample_index;
    uint32_t sample_rate;
    uint32_t pending_sample_rate;
    uint32_t release_index;
    uint32_t release_samples;
    uint16_t gain_percent;
    uint16_t pending_gain_percent;
} audio_cue_state_t;

typedef struct {
    uint16_t len;
    uint8_t bytes[IC_MAX_PACKET_BYTES];
} audio_tx_packet_t;

typedef struct {
    uint32_t active_preroll_frames;
    uint32_t idle_frames;
} playback_codec_mute_gate_t;

typedef enum {
    AUDIO_DIAGNOSTIC_NORMAL,
    AUDIO_DIAGNOSTIC_OUTPUT_TEST,
    AUDIO_DIAGNOSTIC_CAPTURE_TEST,
    AUDIO_DIAGNOSTIC_LOCAL_LOOPBACK,
} audio_diagnostic_mode_t;

typedef struct {
    bool msb_format;
    bool data_width_32;
    bool slot_width_32;
    bool mclk_enabled;
    bool pa_active_high;
    bool swapped_ws_dout_pins;
} i2s_runtime_options_t;

typedef enum {
    ESP32_ADC_DIFFERENCE,
    ESP32_ADC_MIC1,
    ESP32_ADC_MIC2,
    ESP32_ADC_LINE1,
    ESP32_ADC_LINE2,
} esp32_adc_input_t;

typedef enum {
    ESP32_CAPTURE_LEFT,
    ESP32_CAPTURE_RIGHT,
    ESP32_CAPTURE_AVERAGE,
} esp32_capture_channel_t;

typedef enum {
    ESP32_SIDETONE_OFF,
    ESP32_SIDETONE_FIRMWARE,
    ESP32_SIDETONE_CODEC_BYPASS,
} esp32_sidetone_mode_t;

typedef enum {
    ESP32_OUTPUT_ROUTE_BOTH,
    ESP32_OUTPUT_ROUTE_OUT1,
    ESP32_OUTPUT_ROUTE_OUT2,
} esp32_output_route_t;

typedef struct {
    bool server_control_enabled;
    esp32_adc_input_t adc_input;
    uint8_t mic_pga_gain_db;
    esp32_capture_channel_t capture_channel;
    bool high_pass_enabled;
    uint16_t mic_software_gain_percent;
    uint16_t speaker_software_gain_percent;
    uint16_t notification_gain_percent;
    bool alc_enabled;
    bool noise_gate_enabled;
    esp32_sidetone_mode_t sidetone_mode;
    uint16_t sidetone_firmware_gain_percent;
    uint16_t sidetone_codec_bypass_gain_percent;
    uint16_t sidetone_mic_bypass_gain_percent;
} esp32_audio_config_t;

static EventGroupHandle_t s_wifi_events;
static SemaphoreHandle_t s_config_lock;
static QueueHandle_t s_codec_mute_queue;
static QueueHandle_t s_audio_tx_queue;
static QueueHandle_t s_audio_config_queue;
static SemaphoreHandle_t s_ws_send_lock;
static runtime_config_t s_config;
static ic_pcm_frame_ring_t s_playback_ring;
static ic_pcm_frame_ring_t s_sidetone_ring;
static portMUX_TYPE s_capture_health_lock = portMUX_INITIALIZER_UNLOCKED;
static portMUX_TYPE s_audio_config_lock = portMUX_INITIALIZER_UNLOCKED;
static portMUX_TYPE s_audio_cue_lock = portMUX_INITIALIZER_UNLOCKED;
static portMUX_TYPE s_codec_mute_lock = portMUX_INITIALIZER_UNLOCKED;
static portMUX_TYPE s_control_state_lock = portMUX_INITIALIZER_UNLOCKED;
static capture_health_report_t s_capture_health_report;
static audio_cue_state_t s_audio_cue;
static esp32_audio_config_t s_audio_config;
static float s_high_pass_previous_input;
static float s_high_pass_previous_output;
static int16_t s_playback_mono_frame[IC_MAX_SAMPLES_PER_FRAME];
static int16_t s_playback_sidetone_frame[IC_MAX_SAMPLES_PER_FRAME];
static int16_t s_playback_stereo_frame[IC_MAX_SAMPLES_PER_FRAME * 2];
static int16_t s_capture_stereo_frame[IC_MAX_SAMPLES_PER_FRAME * 2];
static int16_t s_capture_mono_frame[IC_MAX_SAMPLES_PER_FRAME];
static int16_t s_capture_packet_frame[IC_MAX_SAMPLES_PER_FRAME];
static uint8_t s_capture_payload[IC_MAX_BYTES_PER_FRAME];
static tx_target_t s_capture_targets[MAX_CHANNELS + MAX_DIRECT_USERS];
static int16_t s_capture_resample_history[6];
static bool s_capture_resample_history_ready = false;
static uint8_t s_udp_rx_packet[IC_MAX_PACKET_BYTES];
static int16_t s_udp_playback_frame[IC_MAX_SAMPLES_PER_FRAME];
static int16_t s_udp_packet_frame[IC_MAX_SAMPLES_PER_FRAME];
static audio_tx_packet_t s_audio_tx_encode_packet;
static audio_tx_packet_t s_audio_tx_send_packet;
static char s_control_rx_buffer[CONTROL_RX_MAX_BYTES + 1];
static size_t s_control_rx_expected_len;
static size_t s_control_rx_received_len;
static esp_websocket_client_handle_t s_ws_client;
static int s_audio_sock = -1;
static uint16_t s_audio_seq;
static uint16_t s_registration_seq;
static uint16_t s_runtime_user_id;
static char s_client_uid[37];
static bool s_codec_output_mute_requested;
static bool s_control_connected;
static bool s_control_hello_pending;
static bool s_control_startup_config_pending;
static int16_t s_audio_cue_sine_lut[AUDIO_CUE_SINE_LUT_SIZE];
static bool s_audio_cue_sine_lut_ready;
static i2c_master_bus_handle_t s_i2c_bus;
static i2c_master_dev_handle_t s_i2c_codec_dev;
static i2s_runtime_options_t s_i2s_options;
static bool s_audio_hw_ready;
static int64_t s_audio_hw_last_write_start_us;
static int64_t s_audio_hw_last_write_warn_us;
static uint32_t s_audio_hw_write_gap_warnings;
static uint32_t s_audio_hw_write_slow_warnings;
static uint32_t s_audio_hw_write_short_warnings;

