gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
static physical_button_t s_dedicated_buttons[] = {
    {CONFIG_INTERCOM_BUTTON1_GPIO, CONFIG_INTERCOM_BUTTON1_ID, CONFIG_INTERCOM_BUTTON1_LABEL, false, false, 0},
    {CONFIG_INTERCOM_BUTTON2_GPIO, CONFIG_INTERCOM_BUTTON2_ID, CONFIG_INTERCOM_BUTTON2_LABEL, false, false, 0},
};

static cJSON *codec_config_json(void);
static esp_err_t audio_hw_init(void);
static esp_err_t audio_hw_probe_codec(void);
static esp_err_t audio_hw_apply_audio_config(const esp32_audio_config_t *config);
static esp_err_t audio_hw_apply_output_registers(const char *label,
                                                 uint8_t dac_power,
                                                 uint8_t out1_volume,
                                                 uint8_t out2_volume,
                                                 bool log_readback);
static esp_err_t audio_hw_apply_output_route(esp32_output_route_t route, bool log_readback);
static esp_err_t audio_hw_set_pa_gpio_level(bool high);
static esp_err_t audio_hw_write_es8388_reg(int reg, int value, const char *name);
static esp_err_t audio_hw_read_es8388_reg_value(int reg, int *value, const char *name);
static esp_err_t audio_hw_update_es8388_reg_bits(int reg, int clear_mask, int set_bits, const char *name);
static esp_err_t audio_hw_write(const int16_t *stereo_frame, size_t bytes);
static esp_err_t audio_hw_read(int16_t *stereo_frame, size_t bytes);
static esp_err_t es8388_apply_audio_config(const esp32_audio_config_t *config);
static void request_audio_config_apply(const esp32_audio_config_t *config);
static esp_err_t es8388_set_playback_mute(bool mute);
static esp_err_t audio_i2s_set_codec(ic_codec_t codec);
static void es8388_dump_registers(const char *reason, const esp32_audio_config_t *config, bool warn_on_mismatch);
static ic_codec_t default_codec(void);
static bool codec_supported(ic_codec_t codec);
static uint32_t samples_for_ms_u32(uint32_t sample_rate, uint32_t ms);
static float smoothstep_unit(float x);

static audio_diagnostic_mode_t audio_diagnostic_mode(void)
{
#if CONFIG_INTERCOM_AUDIO_DIAGNOSTIC_OUTPUT_TEST
    return AUDIO_DIAGNOSTIC_OUTPUT_TEST;
#elif CONFIG_INTERCOM_AUDIO_DIAGNOSTIC_CAPTURE_TEST
    return AUDIO_DIAGNOSTIC_CAPTURE_TEST;
#elif CONFIG_INTERCOM_AUDIO_DIAGNOSTIC_LOCAL_LOOPBACK
    return AUDIO_DIAGNOSTIC_LOCAL_LOOPBACK;
#else
    return AUDIO_DIAGNOSTIC_NORMAL;
#endif
}

static const char *audio_diagnostic_mode_name(audio_diagnostic_mode_t mode)
{
    switch (mode) {
    case AUDIO_DIAGNOSTIC_OUTPUT_TEST:
        return "output-test";
    case AUDIO_DIAGNOSTIC_CAPTURE_TEST:
        return "capture-test";
    case AUDIO_DIAGNOSTIC_LOCAL_LOOPBACK:
        return "local-loopback";
    case AUDIO_DIAGNOSTIC_NORMAL:
    default:
        return "normal";
    }
}

static i2s_runtime_options_t default_i2s_options(void)
{
    return (i2s_runtime_options_t){
        .msb_format =
#if CONFIG_INTERCOM_I2S_FORMAT_MSB
            true,
#else
            false,
#endif
        .data_width_32 = false,
        .slot_width_32 =
#if CONFIG_INTERCOM_I2S_SLOT_WIDTH_32
            true,
#else
            false,
#endif
        .mclk_enabled = CONFIG_INTERCOM_I2S_MCLK_GPIO >= 0,
        .pa_active_high =
#if CONFIG_INTERCOM_PA_ACTIVE_LOW
            false,
#else
            true,
#endif
        .swapped_ws_dout_pins =
#if CONFIG_INTERCOM_I2S_SWAP_WS_DOUT_PINS
            true,
#else
            false,
#endif
    };
}

static const char *i2s_format_name_for(const i2s_runtime_options_t *options)
{
    return options && options->msb_format ? "msb" : "philips";
}

static const char *i2s_slot_width_name_for(const i2s_runtime_options_t *options)
{
    return options && options->slot_width_32 ? "32" : "16";
}

static const char *i2s_data_width_name_for(const i2s_runtime_options_t *options)
{
    return options && options->data_width_32 ? "32" : "16";
}

static const char *i2s_pin_profile_name_for(const i2s_runtime_options_t *options)
{
    return options && options->swapped_ws_dout_pins ? "ws26-dout25" : "configured";
}

static const char *i2s_format_name(void)
{
    return i2s_format_name_for(&s_i2s_options);
}

static const char *i2s_slot_width_name(void)
{
    return i2s_slot_width_name_for(&s_i2s_options);
}

static const char *i2s_data_width_name(void)
{
    return i2s_data_width_name_for(&s_i2s_options);
}

static const char *i2s_pin_profile_name(void)
{
    return i2s_pin_profile_name_for(&s_i2s_options);
}

static i2s_comm_format_t i2s_legacy_comm_format_for(const i2s_runtime_options_t *options)
{
    return options && options->msb_format ? I2S_COMM_FORMAT_STAND_MSB : I2S_COMM_FORMAT_STAND_I2S;
}

static const char *output_route_name(esp32_output_route_t route)
{
    switch (route) {
    case ESP32_OUTPUT_ROUTE_OUT1:
        return "out1";
    case ESP32_OUTPUT_ROUTE_OUT2:
        return "out2";
    case ESP32_OUTPUT_ROUTE_BOTH:
    default:
        return "out1+out2";
    }
}

static int16_t clamp_i16(int value)
{
    if (value > INT16_MAX) {
        return INT16_MAX;
    }
    if (value < INT16_MIN) {
        return INT16_MIN;
    }
    return (int16_t)value;
}

static int abs_i16_value(int16_t value)
{
    return value == INT16_MIN ? 32768 : abs((int)value);
}

static esp32_adc_input_t default_adc_input(void)
{
#if CONFIG_INTERCOM_ES8388_ADC_INPUT_MIC1
    return ESP32_ADC_MIC1;
#elif CONFIG_INTERCOM_ES8388_ADC_INPUT_MIC2
    return ESP32_ADC_MIC2;
#elif CONFIG_INTERCOM_ES8388_ADC_INPUT_LINE1
    return ESP32_ADC_LINE1;
#elif CONFIG_INTERCOM_ES8388_ADC_INPUT_LINE2
    return ESP32_ADC_LINE2;
#else
    return ESP32_ADC_DIFFERENCE;
#endif
}

static esp32_capture_channel_t default_capture_channel(void)
{
#if CONFIG_INTERCOM_CAPTURE_CHANNEL_RIGHT
    return ESP32_CAPTURE_RIGHT;
#elif CONFIG_INTERCOM_CAPTURE_CHANNEL_AVERAGE
    return ESP32_CAPTURE_AVERAGE;
#else
    return ESP32_CAPTURE_LEFT;
#endif
}

static uint8_t default_mic_pga_gain_db(void)
{
#if CONFIG_INTERCOM_ES8388_MIC_PGA_GAIN_0DB
    return 0;
#elif CONFIG_INTERCOM_ES8388_MIC_PGA_GAIN_3DB
    return 3;
#elif CONFIG_INTERCOM_ES8388_MIC_PGA_GAIN_6DB
    return 6;
#elif CONFIG_INTERCOM_ES8388_MIC_PGA_GAIN_12DB
    return 12;
#elif CONFIG_INTERCOM_ES8388_MIC_PGA_GAIN_15DB
    return 15;
#elif CONFIG_INTERCOM_ES8388_MIC_PGA_GAIN_18DB
    return 18;
#elif CONFIG_INTERCOM_ES8388_MIC_PGA_GAIN_21DB
    return 21;
#elif CONFIG_INTERCOM_ES8388_MIC_PGA_GAIN_24DB
    return 24;
#else
    return 9;
#endif
}

static esp32_sidetone_mode_t default_sidetone_mode(void)
{
#if CONFIG_INTERCOM_SIDETONE_FIRMWARE
    return ESP32_SIDETONE_FIRMWARE;
#else
    return ESP32_SIDETONE_OFF;
#endif
}

static esp32_audio_config_t default_audio_config(void)
{
    return (esp32_audio_config_t){
        .server_control_enabled = false,
        .adc_input = default_adc_input(),
        .mic_pga_gain_db = default_mic_pga_gain_db(),
        .capture_channel = default_capture_channel(),
#if CONFIG_INTERCOM_CAPTURE_HIGH_PASS
        .high_pass_enabled = true,
#else
        .high_pass_enabled = false,
#endif
#if CONFIG_INTERCOM_ES8388_ALC
        .alc_enabled = true,
#else
        .alc_enabled = false,
#endif
#if CONFIG_INTERCOM_ES8388_NOISE_GATE
        .noise_gate_enabled = true,
#else
        .noise_gate_enabled = false,
#endif
        .mic_software_gain_percent = CONFIG_INTERCOM_MIC_GAIN_PERCENT,
        .speaker_software_gain_percent = CONFIG_INTERCOM_SPEAKER_GAIN_PERCENT,
        .notification_gain_percent = CONFIG_INTERCOM_NOTIFICATION_GAIN_PERCENT,
        .sidetone_mode = default_sidetone_mode(),
        .sidetone_codec_bypass_gain_percent = CONFIG_INTERCOM_SIDETONE_CODEC_BYPASS_GAIN_PERCENT,
        .sidetone_mic_bypass_gain_percent = CONFIG_INTERCOM_SIDETONE_MIC_BYPASS_GAIN_PERCENT,
#if CONFIG_INTERCOM_SIDETONE_FIRMWARE
        .sidetone_firmware_gain_percent = CONFIG_INTERCOM_SIDETONE_GAIN_PERCENT,
#else
        .sidetone_firmware_gain_percent = 0,
#endif
    };
}

static void audio_config_init(void)
{
    taskENTER_CRITICAL(&s_audio_config_lock);
    s_audio_config = default_audio_config();
    taskEXIT_CRITICAL(&s_audio_config_lock);
}

static esp32_audio_config_t audio_config_snapshot(void)
{
    esp32_audio_config_t config;
    taskENTER_CRITICAL(&s_audio_config_lock);
    config = s_audio_config;
    taskEXIT_CRITICAL(&s_audio_config_lock);
    return config;
}

