gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
static void audio_config_store(const esp32_audio_config_t *config)
{
    taskENTER_CRITICAL(&s_audio_config_lock);
    s_audio_config = *config;
    s_high_pass_previous_input = 0.0f;
    s_high_pass_previous_output = 0.0f;
    taskEXIT_CRITICAL(&s_audio_config_lock);
}

static bool audio_config_equal(const esp32_audio_config_t *a, const esp32_audio_config_t *b)
{
    return a && b && a->server_control_enabled == b->server_control_enabled && a->adc_input == b->adc_input &&
           a->mic_pga_gain_db == b->mic_pga_gain_db && a->capture_channel == b->capture_channel &&
           a->high_pass_enabled == b->high_pass_enabled &&
           a->mic_software_gain_percent == b->mic_software_gain_percent &&
           a->speaker_software_gain_percent == b->speaker_software_gain_percent &&
           a->notification_gain_percent == b->notification_gain_percent && a->alc_enabled == b->alc_enabled &&
           a->noise_gate_enabled == b->noise_gate_enabled && a->sidetone_mode == b->sidetone_mode &&
           a->sidetone_firmware_gain_percent == b->sidetone_firmware_gain_percent &&
           a->sidetone_codec_bypass_gain_percent == b->sidetone_codec_bypass_gain_percent &&
           a->sidetone_mic_bypass_gain_percent == b->sidetone_mic_bypass_gain_percent;
}

static ic_codec_t runtime_codec_snapshot(void)
{
    ic_codec_t codec = default_codec();
    if (s_config_lock) {
        xSemaphoreTake(s_config_lock, portMAX_DELAY);
        codec = s_config.codec;
        xSemaphoreGive(s_config_lock);
    }
    return codec_supported(codec) ? codec : IC_CODEC_PCM16;
}

static const char *adc_input_name(esp32_adc_input_t input)
{
    switch (input) {
    case ESP32_ADC_MIC1:
        return "mic1";
    case ESP32_ADC_MIC2:
        return "mic2";
    case ESP32_ADC_LINE1:
        return "line1";
    case ESP32_ADC_LINE2:
        return "line2";
    case ESP32_ADC_DIFFERENCE:
    default:
        return "difference";
    }
}

static uint8_t es8388_adc_input_value(esp32_adc_input_t input)
{
    switch (input) {
    case ESP32_ADC_MIC1:
        return ES8388_ADC_INPUT_MIC1;
    case ESP32_ADC_MIC2:
        return ES8388_ADC_INPUT_MIC2;
    case ESP32_ADC_LINE1:
        return ES8388_ADC_INPUT_LINE1;
    case ESP32_ADC_LINE2:
        return ES8388_ADC_INPUT_LINE2;
    case ESP32_ADC_DIFFERENCE:
    default:
        return ES8388_ADC_INPUT_DIFFERENCE;
    }
}

static const char *capture_channel_name(esp32_capture_channel_t channel)
{
    switch (channel) {
    case ESP32_CAPTURE_RIGHT:
        return "right";
    case ESP32_CAPTURE_AVERAGE:
        return "average";
    case ESP32_CAPTURE_LEFT:
    default:
        return "left";
    }
}

static const char *sidetone_mode_name(esp32_sidetone_mode_t mode)
{
    switch (mode) {
    case ESP32_SIDETONE_FIRMWARE:
        return "firmware";
    case ESP32_SIDETONE_CODEC_BYPASS:
        return "codec_bypass";
    case ESP32_SIDETONE_OFF:
    default:
        return "off";
    }
}

static int capture_select_sample(const esp32_audio_config_t *config, int16_t left, int16_t right)
{
    switch (config->capture_channel) {
    case ESP32_CAPTURE_RIGHT:
        return right;
    case ESP32_CAPTURE_AVERAGE:
        return ((int)left + (int)right) / 2;
    case ESP32_CAPTURE_LEFT:
    default:
        return left;
    }
}

static int capture_high_pass_sample(const esp32_audio_config_t *config, int sample)
{
    if (!config->high_pass_enabled) {
        return sample;
    }
    float input = (float)sample;
    float output = input - s_high_pass_previous_input + CAPTURE_HIGH_PASS_ALPHA * s_high_pass_previous_output;
    s_high_pass_previous_input = input;
    s_high_pass_previous_output = output;
    return (int)lrintf(output);
}

static int16_t read_le_i16(const uint8_t *bytes)
{
    return (int16_t)((uint16_t)bytes[0] | ((uint16_t)bytes[1] << 8));
}

static int task_core(int configured)
{
    return configured < 0 ? tskNO_AFFINITY : configured;
}

static void channel_list_add(channel_list_t *list, uint16_t value)
{
    if (!list || value == 0) {
        return;
    }
    for (size_t i = 0; i < list->count; i++) {
        if (list->values[i] == value) {
            return;
        }
    }
    if (list->count < MAX_CHANNELS) {
        list->values[list->count++] = value;
    }
}

static void user_list_add(user_list_t *list, uint16_t value)
{
    if (!list || value == 0) {
        return;
    }
    for (size_t i = 0; i < list->count; i++) {
        if (list->values[i] == value) {
            return;
        }
    }
    if (list->count < MAX_DIRECT_USERS) {
        list->values[list->count++] = value;
    }
}

static void parse_channel_csv(const char *csv, channel_list_t *out)
{
    memset(out, 0, sizeof(*out));
    if (!csv || !*csv) {
        return;
    }

    char buf[96];
    strlcpy(buf, csv, sizeof(buf));
    char *save = NULL;
    for (char *part = strtok_r(buf, ",", &save); part; part = strtok_r(NULL, ",", &save)) {
        long value = strtol(part, NULL, 10);
        if (value > 0 && value <= UINT16_MAX) {
            channel_list_add(out, (uint16_t)value);
        }
    }
}

static bool string_eq(const char *a, const char *b)
{
    return a && b && strcmp(a, b) == 0;
}

static talk_mode_t parse_talk_mode(const char *mode)
{
    if (string_eq(mode, "muted")) {
        return TALK_MODE_MUTED;
    }
    if (string_eq(mode, "open")) {
        return TALK_MODE_OPEN;
    }
    return TALK_MODE_PTT;
}

static const char *talk_mode_wire(talk_mode_t mode)
{
    switch (mode) {
    case TALK_MODE_MUTED:
        return "muted";
    case TALK_MODE_OPEN:
        return "open";
    case TALK_MODE_PTT:
    default:
        return "ptt";
    }
}

static ic_codec_t default_codec(void)
{
#if CONFIG_INTERCOM_INITIAL_CODEC_PCM48
    return IC_CODEC_PCM48;
#elif CONFIG_INTERCOM_INITIAL_CODEC_PCM24
    return IC_CODEC_PCM24;
#else
    return IC_CODEC_PCM16;
#endif
}

static bool codec_supported(ic_codec_t codec)
{
    return codec == IC_CODEC_PCM16 || codec == IC_CODEC_PCM24 || codec == IC_CODEC_PCM48;
}

