gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
static gpio_num_t audio_i2s_ws_gpio_for(const i2s_runtime_options_t *options)
{
    return (gpio_num_t)(options && options->swapped_ws_dout_pins ? CONFIG_INTERCOM_I2S_DOUT_GPIO
                                                                 : CONFIG_INTERCOM_I2S_WS_GPIO);
}

static gpio_num_t audio_i2s_dout_gpio_for(const i2s_runtime_options_t *options)
{
    return (gpio_num_t)(options && options->swapped_ws_dout_pins ? CONFIG_INTERCOM_I2S_WS_GPIO
                                                                 : CONFIG_INTERCOM_I2S_DOUT_GPIO);
}

static i2s_bits_per_chan_t audio_i2s_bits_per_chan_for(const i2s_runtime_options_t *options)
{
    return options && (options->slot_width_32 || options->data_width_32) ? I2S_BITS_PER_CHAN_32BIT
                                                                         : I2S_BITS_PER_CHAN_16BIT;
}

static void audio_i2s_log_channel_info(const char *label)
{
    ESP_LOGI(TAG,
             "legacy I2S %s: sample_rate=%u Hz mclk=%u Hz bclk=%u Hz format=%s data_width=%s slot_width=%s pins=%s",
             label,
             ESP32_AUDIO_HW_SAMPLE_RATE,
             s_i2s_options.mclk_enabled ? ESP32_AUDIO_HW_SAMPLE_RATE * 256U : 0U,
             ESP32_AUDIO_HW_SAMPLE_RATE * ESP32_AUDIO_HW_CHANNELS *
                 (s_i2s_options.slot_width_32 ? 32U : 16U),
             i2s_format_name(),
             i2s_data_width_name(),
             i2s_slot_width_name(),
             i2s_pin_profile_name());
}

static const char *codec_wire(ic_codec_t codec)
{
    switch (codec) {
    case IC_CODEC_PCM24:
        return "pcm24";
    case IC_CODEC_PCM48:
        return "pcm48";
    case IC_CODEC_PCM16:
    default:
        return "pcm16";
    }
}

static bool parse_codec_value(const char *value, ic_codec_t *out)
{
    if (string_eq(value, "pcm16") || string_eq(value, "pcm")) {
        *out = IC_CODEC_PCM16;
        return true;
    }
    if (string_eq(value, "pcm24") || string_eq(value, "pcm-24")) {
        *out = IC_CODEC_PCM24;
        return true;
    }
    if (string_eq(value, "pcm48") || string_eq(value, "pcm-48")) {
        *out = IC_CODEC_PCM48;
        return true;
    }
    return false;
}

static size_t codec_samples_per_frame(ic_codec_t codec)
{
    switch (codec) {
    case IC_CODEC_PCM24:
        return IC_PCM24_SAMPLES_PER_FRAME;
    case IC_CODEC_PCM48:
        return IC_PCM48_SAMPLES_PER_FRAME;
    case IC_CODEC_PCM16:
    default:
        return IC_PCM16_SAMPLES_PER_FRAME;
    }
}

static size_t codec_payload_bytes(ic_codec_t codec)
{
    return codec_samples_per_frame(codec) * sizeof(int16_t);
}

static int16_t clamp_i32_to_i16(int32_t value)
{
    if (value > INT16_MAX) {
        return INT16_MAX;
    }
    if (value < INT16_MIN) {
        return INT16_MIN;
    }
    return (int16_t)value;
}

static int16_t lerp_i16(int16_t a, int16_t b, int numerator, int denominator)
{
    int32_t mixed = ((int32_t)a * (denominator - numerator)) + ((int32_t)b * numerator);
    if (mixed >= 0) {
        mixed += denominator / 2;
    } else {
        mixed -= denominator / 2;
    }
    return clamp_i32_to_i16(mixed / denominator);
}

static int16_t history_sample_or_current(const int16_t *in, int index)
{
    if (index >= 0) {
        return in[index];
    }
    int history_index = (int)(sizeof(s_capture_resample_history) / sizeof(s_capture_resample_history[0])) + index;
    if (history_index < 0) {
        history_index = 0;
    }
    return s_capture_resample_history[history_index];
}

static void capture_resample_history_prepare(const int16_t *in)
{
    if (s_capture_resample_history_ready) {
        return;
    }
    for (size_t i = 0; i < sizeof(s_capture_resample_history) / sizeof(s_capture_resample_history[0]); i++) {
        s_capture_resample_history[i] = in ? in[0] : 0;
    }
    s_capture_resample_history_ready = true;
}

static void capture_resample_history_update(const int16_t *in)
{
    size_t history_len = sizeof(s_capture_resample_history) / sizeof(s_capture_resample_history[0]);
    for (size_t i = 0; i < history_len; i++) {
        s_capture_resample_history[i] = in[ESP32_AUDIO_HW_SAMPLES_PER_FRAME - history_len + i];
    }
    s_capture_resample_history_ready = true;
}

static int16_t fir_7tap_48k_to_16k_causal(const int16_t *in, size_t center)
{
    static const int taps[7] = {1, 3, 6, 8, 6, 3, 1};
    int32_t sum = 0;
    for (int i = 0; i < 7; i++) {
        sum += (int32_t)history_sample_or_current(in, (int)center + i - 6) * taps[i];
    }
    return clamp_i32_to_i16(sum / 28);
}

static int16_t fir_5tap_48k_to_24k_causal(const int16_t *in, size_t center)
{
    static const int taps[5] = {1, 4, 6, 4, 1};
    int32_t sum = 0;
    for (int i = 0; i < 5; i++) {
        sum += (int32_t)history_sample_or_current(in, (int)center + i - 4) * taps[i];
    }
    return clamp_i32_to_i16(sum / 16);
}

static void resample_network_to_hw(const int16_t *in, size_t in_samples, int16_t *out)
{
    if (!in || !out || in_samples == 0) {
        if (out) {
            memset(out, 0, ESP32_AUDIO_HW_SAMPLES_PER_FRAME * sizeof(int16_t));
        }
        return;
    }
    if (in_samples == ESP32_AUDIO_HW_SAMPLES_PER_FRAME) {
        memcpy(out, in, ESP32_AUDIO_HW_SAMPLES_PER_FRAME * sizeof(int16_t));
        return;
    }
    if (in_samples == IC_PCM24_SAMPLES_PER_FRAME) {
        for (size_t i = 0; i < in_samples; i++) {
            out[i * 2] = in[i];
            out[i * 2 + 1] = lerp_i16(in[i], in[(i + 1 < in_samples) ? i + 1 : i], 1, 2);
        }
        return;
    }
    if (in_samples == IC_PCM16_SAMPLES_PER_FRAME) {
        for (size_t i = 0; i < in_samples; i++) {
            int16_t next = in[(i + 1 < in_samples) ? i + 1 : i];
            out[i * 3] = in[i];
            out[i * 3 + 1] = lerp_i16(in[i], next, 1, 3);
            out[i * 3 + 2] = lerp_i16(in[i], next, 2, 3);
        }
        return;
    }
    for (size_t i = 0; i < ESP32_AUDIO_HW_SAMPLES_PER_FRAME; i++) {
        size_t source = (i * in_samples) / ESP32_AUDIO_HW_SAMPLES_PER_FRAME;
        if (source >= in_samples) {
            source = in_samples - 1;
        }
        out[i] = in[source];
    }
}

static void resample_hw_to_network(const int16_t *in, int16_t *out, size_t out_samples)
{
    if (!in || !out || out_samples == 0) {
        return;
    }
    capture_resample_history_prepare(in);
    if (out_samples == ESP32_AUDIO_HW_SAMPLES_PER_FRAME) {
        memcpy(out, in, ESP32_AUDIO_HW_SAMPLES_PER_FRAME * sizeof(int16_t));
        capture_resample_history_update(in);
        return;
    }
    if (out_samples == IC_PCM24_SAMPLES_PER_FRAME) {
        for (size_t i = 0; i < out_samples; i++) {
            out[i] = fir_5tap_48k_to_24k_causal(in, i * 2 + 1);
        }
        capture_resample_history_update(in);
        return;
    }
    if (out_samples == IC_PCM16_SAMPLES_PER_FRAME) {
        for (size_t i = 0; i < out_samples; i++) {
            out[i] = fir_7tap_48k_to_16k_causal(in, i * 3 + 2);
        }
        capture_resample_history_update(in);
        return;
    }
    for (size_t i = 0; i < out_samples; i++) {
        size_t start = (i * ESP32_AUDIO_HW_SAMPLES_PER_FRAME) / out_samples;
        size_t end = ((i + 1) * ESP32_AUDIO_HW_SAMPLES_PER_FRAME) / out_samples;
        if (end <= start) {
            end = start + 1;
        }
        int sum = 0;
        size_t count = 0;
        for (size_t j = start; j < end && j < ESP32_AUDIO_HW_SAMPLES_PER_FRAME; j++) {
            sum += in[j];
            count++;
        }
        out[i] = count ? (int16_t)(sum / (int)count) : 0;
    }
    capture_resample_history_update(in);
}

