gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
static uint32_t audio_cue_switch_ramp_samples(uint32_t sample_rate)
{
    uint32_t samples = sample_rate * AUDIO_CUE_SWITCH_RAMP_MS / 1000;
    return samples < 16 ? 16 : samples;
}

static void audio_cue_lut_init(void)
{
    for (size_t i = 0; i < AUDIO_CUE_SINE_LUT_SIZE; i++) {
        float phase = 2.0f * AUDIO_CUE_PI * (float)i / (float)AUDIO_CUE_SINE_LUT_SIZE;
        s_audio_cue_sine_lut[i] = (int16_t)lrintf(sinf(phase) * 32767.0f);
    }
    s_audio_cue_sine_lut_ready = true;
}

static void audio_cue_activate_locked(audio_cue_kind_t kind, uint32_t sample_rate, uint16_t gain_percent)
{
    s_audio_cue.kind = kind;
    s_audio_cue.pending_kind = AUDIO_CUE_NONE;
    s_audio_cue.sample_index = 0;
    s_audio_cue.sample_rate = sample_rate;
    s_audio_cue.pending_sample_rate = 0;
    s_audio_cue.release_index = 0;
    s_audio_cue.release_samples = 0;
    s_audio_cue.gain_percent = gain_percent;
    s_audio_cue.pending_gain_percent = 0;
}

static void audio_cue_replace(audio_cue_kind_t kind)
{
    uint32_t sample_rate = ESP32_AUDIO_HW_SAMPLE_RATE;
    uint16_t gain_percent = audio_config_snapshot().notification_gain_percent;
    taskENTER_CRITICAL(&s_audio_cue_lock);
    audio_cue_activate_locked(kind, sample_rate, gain_percent);
    taskEXIT_CRITICAL(&s_audio_cue_lock);
}

static void audio_cue_start(audio_cue_kind_t kind)
{
    uint32_t sample_rate = ESP32_AUDIO_HW_SAMPLE_RATE;
    uint16_t gain_percent = audio_config_snapshot().notification_gain_percent;
    taskENTER_CRITICAL(&s_audio_cue_lock);
    if (s_audio_cue.kind == AUDIO_CUE_NONE) {
        audio_cue_activate_locked(kind, sample_rate, gain_percent);
    } else if (s_audio_cue.kind != kind || s_audio_cue.pending_kind != AUDIO_CUE_NONE) {
        s_audio_cue.pending_kind = kind;
        s_audio_cue.pending_sample_rate = sample_rate;
        s_audio_cue.pending_gain_percent = gain_percent;
        if (s_audio_cue.release_samples == 0) {
            s_audio_cue.release_index = 0;
            s_audio_cue.release_samples = audio_cue_switch_ramp_samples(s_audio_cue.sample_rate);
        }
    }
    taskEXIT_CRITICAL(&s_audio_cue_lock);
}

static float cue_tone_envelope(uint32_t sample, uint32_t total)
{
    if (total == 0) {
        return 0.0f;
    }
    uint32_t attack = total / 5;
    uint32_t release = total / 3;
    if (attack < 16) {
        attack = 16;
    }
    if (release < 16) {
        release = 16;
    }
    if (attack + release > total) {
        attack = total / 3;
        release = total / 3;
    }
    float envelope = 1.0f;
    if (attack > 0 && sample < attack) {
        envelope *= smoothstep_unit((float)sample / (float)attack);
    }
    if (release > 0 && sample + release >= total) {
        uint32_t remaining = total > sample ? total - sample : 0;
        envelope *= smoothstep_unit((float)remaining / (float)release);
    }
    float progress = (float)sample / (float)total;
    return envelope * (1.0f - (0.55f * progress));
}

static float cue_release_multiplier(uint32_t index, uint32_t samples)
{
    if (samples == 0) {
        return 1.0f;
    }
    return 1.0f - smoothstep_unit((float)index / (float)samples);
}

static void audio_cue_params(audio_cue_kind_t kind,
                             uint32_t sample_rate,
                             uint32_t sample_index,
                             uint32_t *total,
                             uint32_t *freq,
                             uint32_t *local,
                             uint32_t *tone_total,
                             float *amplitude_scale)
{
    *total = 0;
    *freq = 0;
    *local = 0;
    *tone_total = 0;
    *amplitude_scale = 1.0f;

    switch (kind) {
    case AUDIO_CUE_CONNECTED: {
        uint32_t tone_a = sample_rate * 90 / 1000;
        uint32_t gap = sample_rate * 45 / 1000;
        uint32_t tone_b = sample_rate * 120 / 1000;
        *total = tone_a + gap + tone_b;
        *amplitude_scale = 0.58f;
        if (sample_index < tone_a) {
            *freq = 523;
            *local = sample_index;
            *tone_total = tone_a;
        } else if (sample_index < tone_a + gap) {
            *freq = 0;
        } else {
            *freq = 659;
            *local = sample_index - tone_a - gap;
            *tone_total = tone_b;
        }
        break;
    }
    case AUDIO_CUE_DISCONNECTED: {
        uint32_t tone_a = sample_rate * 190 / 1000;
        *total = tone_a;
        *amplitude_scale = 0.42f;
        if (sample_index < tone_a) {
            *freq = 330;
            *local = sample_index;
            *tone_total = tone_a;
        }
        break;
    }
    case AUDIO_CUE_RECONNECTING: {
        uint32_t tone_a = sample_rate * 170 / 1000;
        *total = tone_a;
        *amplitude_scale = 0.22f;
        if (sample_index < tone_a) {
            *freq = 392;
            *local = sample_index;
            *tone_total = tone_a;
        }
        break;
    }
    case AUDIO_CUE_NONE:
    default:
        break;
    }
}

static int16_t audio_cue_next_sample(void)
{
    audio_cue_state_t cue;
    taskENTER_CRITICAL(&s_audio_cue_lock);
    cue = s_audio_cue;
    taskEXIT_CRITICAL(&s_audio_cue_lock);

    if (cue.kind == AUDIO_CUE_NONE || cue.sample_rate == 0) {
        return 0;
    }

    uint32_t total;
    uint32_t freq;
    uint32_t local;
    uint32_t tone_total;
    float amplitude_scale;
    audio_cue_params(cue.kind, cue.sample_rate, cue.sample_index, &total, &freq, &local, &tone_total, &amplitude_scale);

    int16_t sample = 0;
    if (cue.sample_index < total && freq > 0 && tone_total > 0) {
        float amplitude = AUDIO_CUE_AMPLITUDE * amplitude_scale * (float)cue.gain_percent / 100.0f;
        uint32_t phase_index =
            (uint32_t)(((uint64_t)local * (uint64_t)freq * AUDIO_CUE_SINE_LUT_SIZE / cue.sample_rate) &
                       (AUDIO_CUE_SINE_LUT_SIZE - 1));
        float sine = s_audio_cue_sine_lut_ready ? (float)s_audio_cue_sine_lut[phase_index] / 32767.0f : 0.0f;
        float shaped = sine * amplitude * cue_tone_envelope(local, tone_total);
        if (cue.release_samples > 0) {
            shaped *= cue_release_multiplier(cue.release_index, cue.release_samples);
        }
        sample = (int16_t)shaped;
    }

    taskENTER_CRITICAL(&s_audio_cue_lock);
    if (s_audio_cue.kind == cue.kind && s_audio_cue.sample_index == cue.sample_index) {
        if (s_audio_cue.release_samples > 0) {
            s_audio_cue.sample_index++;
            s_audio_cue.release_index++;
            if (s_audio_cue.release_index >= s_audio_cue.release_samples) {
                if (s_audio_cue.pending_kind != AUDIO_CUE_NONE) {
                    audio_cue_activate_locked(s_audio_cue.pending_kind,
                                              s_audio_cue.pending_sample_rate,
                                              s_audio_cue.pending_gain_percent);
                } else {
                    s_audio_cue.kind = AUDIO_CUE_NONE;
                    s_audio_cue.sample_index = 0;
                    s_audio_cue.release_index = 0;
                    s_audio_cue.release_samples = 0;
                }
            }
        } else {
            s_audio_cue.sample_index++;
            if (s_audio_cue.sample_index >= total) {
                if (s_audio_cue.pending_kind != AUDIO_CUE_NONE) {
                    audio_cue_activate_locked(s_audio_cue.pending_kind,
                                              s_audio_cue.pending_sample_rate,
                                              s_audio_cue.pending_gain_percent);
                } else {
                    s_audio_cue.kind = AUDIO_CUE_NONE;
                    s_audio_cue.sample_index = 0;
                }
            }
        }
    }
    taskEXIT_CRITICAL(&s_audio_cue_lock);
    return sample;
}

static uint32_t samples_for_ms_u32(uint32_t sample_rate, uint32_t ms)
{
    uint32_t samples = sample_rate * ms / 1000;
    return samples == 0 ? 1 : samples;
}

static float smoothstep_unit(float x)
{
    if (x <= 0.0f) {
        return 0.0f;
    }
    if (x >= 1.0f) {
        return 1.0f;
    }
    return x * x * (3.0f - 2.0f * x);
}

static void fill_playback_fade_to_silence(int16_t *frame, size_t samples, int16_t last_sample)
{
    if (!frame || samples == 0) {
        return;
    }
    for (size_t i = 0; i < samples; i++) {
        int remaining = (int)(samples - i - 1);
        frame[i] = (int16_t)((int)last_sample * remaining / (int)samples);
    }
}

static void apply_playback_fade_in(int16_t *frame, size_t samples)
{
    if (!frame || samples == 0) {
        return;
    }
    for (size_t i = 0; i < samples; i++) {
        frame[i] = (int16_t)((int)frame[i] * (int)i / (int)samples);
    }
}

static int16_t playback_idle_floor_sample(void)
{
    if (!CONFIG_INTERCOM_PLAYBACK_IDLE_FLOOR_ENABLED || CONFIG_INTERCOM_PLAYBACK_IDLE_FLOOR_AMPLITUDE <= 0) {
        return 0;
    }
    return (int16_t)CONFIG_INTERCOM_PLAYBACK_IDLE_FLOOR_AMPLITUDE;
}

static void request_codec_output_mute(bool mute)
{
    bool changed = false;
    taskENTER_CRITICAL(&s_codec_mute_lock);
    if (s_codec_output_mute_requested != mute) {
        s_codec_output_mute_requested = mute;
        changed = true;
    }
    taskEXIT_CRITICAL(&s_codec_mute_lock);

    if (changed && s_codec_mute_queue) {
        (void)xQueueOverwrite(s_codec_mute_queue, &mute);
    }
}

static void codec_output_mute_state_set(bool mute)
{
    taskENTER_CRITICAL(&s_codec_mute_lock);
    s_codec_output_mute_requested = mute;
    taskEXIT_CRITICAL(&s_codec_mute_lock);
}

static void playback_codec_mute_gate_update(playback_codec_mute_gate_t *gate, bool frame_active)
{
    if (frame_active) {
        gate->idle_frames = 0;
        if (gate->active_preroll_frames < PLAYBACK_CODEC_UNMUTE_PREROLL_FRAMES) {
            gate->active_preroll_frames++;
            request_codec_output_mute(true);
        } else {
            request_codec_output_mute(false);
        }
        return;
    }

