gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
    gate->active_preroll_frames = 0;
    if (gate->idle_frames < PLAYBACK_CODEC_IDLE_MUTE_FRAMES) {
        gate->idle_frames++;
    }
    if (gate->idle_frames >= PLAYBACK_CODEC_IDLE_MUTE_FRAMES) {
        request_codec_output_mute(true);
    }
}

static bool physical_button_enabled(const physical_button_t *button)
{
    return button && button->gpio >= 0 && button->id && button->id[0] != '\0';
}

static bool gpio_supports_internal_pullup(int gpio)
{
    return gpio >= 0 && !(gpio >= 34 && gpio <= 39);
}

static void control_connected_set(bool connected)
{
    taskENTER_CRITICAL(&s_control_state_lock);
    s_control_connected = connected;
    if (connected) {
        s_control_hello_pending = true;
        s_control_startup_config_pending = false;
    } else {
        s_control_hello_pending = false;
        s_control_startup_config_pending = false;
    }
    taskEXIT_CRITICAL(&s_control_state_lock);
}

static bool control_connected_snapshot(void)
{
    bool connected;
    taskENTER_CRITICAL(&s_control_state_lock);
    connected = s_control_connected;
    taskEXIT_CRITICAL(&s_control_state_lock);
    return connected;
}

static bool control_take_hello_pending(void)
{
    bool pending = false;
    taskENTER_CRITICAL(&s_control_state_lock);
    if (s_control_connected && s_control_hello_pending) {
        s_control_hello_pending = false;
        pending = true;
    }
    taskEXIT_CRITICAL(&s_control_state_lock);
    return pending;
}

static void control_request_startup_config(void)
{
    taskENTER_CRITICAL(&s_control_state_lock);
    if (s_control_connected) {
        s_control_startup_config_pending = true;
    }
    taskEXIT_CRITICAL(&s_control_state_lock);
}

static bool control_take_startup_config_pending(void)
{
    bool pending = false;
    taskENTER_CRITICAL(&s_control_state_lock);
    if (s_control_connected && s_control_startup_config_pending) {
        s_control_startup_config_pending = false;
        pending = true;
    }
    taskEXIT_CRITICAL(&s_control_state_lock);
    return pending;
}

static uint16_t current_user_id(void)
{
    uint16_t user_id;
    taskENTER_CRITICAL(&s_control_state_lock);
    user_id = s_runtime_user_id;
    taskEXIT_CRITICAL(&s_control_state_lock);
    return user_id ? user_id : CONFIG_INTERCOM_USER_ID;
}

static void set_current_user_id(uint16_t user_id)
{
    if (user_id == 0) {
        return;
    }
    taskENTER_CRITICAL(&s_control_state_lock);
    s_runtime_user_id = user_id;
    taskEXIT_CRITICAL(&s_control_state_lock);
}

static void format_generated_client_uid(char *out, size_t out_len)
{
    uint32_t a = esp_random();
    uint32_t b = esp_random();
    uint32_t c = esp_random();
    uint32_t d = esp_random();
    snprintf(out,
             out_len,
             "%08" PRIx32 "-%04" PRIx32 "-4%03" PRIx32 "-%04" PRIx32 "-%08" PRIx32 "%04" PRIx32,
             a,
             b & 0xffff,
             c & 0x0fff,
             ((c >> 16) & 0x3fff) | 0x8000,
             d,
             (b >> 16) & 0xffff);
}

static void client_identity_init(void)
{
    const char *configured = CONFIG_INTERCOM_CLIENT_UID;
    if (configured && configured[0] != '\0') {
        strlcpy(s_client_uid, configured, sizeof(s_client_uid));
        ESP_LOGI(TAG, "using configured client UID %s", s_client_uid);
        return;
    }

    nvs_handle_t nvs = 0;
    esp_err_t err = nvs_open("intercom", NVS_READWRITE, &nvs);
    if (err != ESP_OK) {
        format_generated_client_uid(s_client_uid, sizeof(s_client_uid));
        ESP_LOGW(TAG, "could not open NVS for client UID (%s); using volatile UID %s", esp_err_to_name(err), s_client_uid);
        return;
    }

    size_t len = sizeof(s_client_uid);
    err = nvs_get_str(nvs, "client_uid", s_client_uid, &len);
    if (err == ESP_OK && s_client_uid[0] != '\0') {
        ESP_LOGI(TAG, "loaded client UID %s", s_client_uid);
        nvs_close(nvs);
        return;
    }

    format_generated_client_uid(s_client_uid, sizeof(s_client_uid));
    err = nvs_set_str(nvs, "client_uid", s_client_uid);
    if (err == ESP_OK) {
        err = nvs_commit(nvs);
    }
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "could not persist client UID (%s); using %s", esp_err_to_name(err), s_client_uid);
    } else {
        ESP_LOGI(TAG, "generated and stored client UID %s", s_client_uid);
    }
    nvs_close(nvs);
}

static bool websocket_ready(void)
{
    return control_connected_snapshot() && s_ws_client && esp_websocket_client_is_connected(s_ws_client);
}

static esp_err_t send_json(cJSON *json)
{
    if (!json || !websocket_ready()) {
        return ESP_FAIL;
    }
    char *text = cJSON_PrintUnformatted(json);
    if (!text) {
        return ESP_ERR_NO_MEM;
    }

    if (!s_ws_send_lock || xSemaphoreTake(s_ws_send_lock, pdMS_TO_TICKS(CONTROL_SEND_MUTEX_TIMEOUT_MS)) != pdTRUE) {
        cJSON_free(text);
        return ESP_ERR_TIMEOUT;
    }
    if (!websocket_ready()) {
        xSemaphoreGive(s_ws_send_lock);
        cJSON_free(text);
        return ESP_FAIL;
    }
    int rc = esp_websocket_client_send_text(s_ws_client, text, strlen(text), pdMS_TO_TICKS(CONTROL_SEND_TIMEOUT_MS));
    xSemaphoreGive(s_ws_send_lock);
    cJSON_free(text);
    if (rc < 0) {
        return ESP_FAIL;
    }
    return ESP_OK;
}

static void log_control_send_result(const char *label, esp_err_t err, bool warn)
{
    if (err == ESP_OK) {
        return;
    }
    if (warn) {
        ESP_LOGW(TAG, "failed to send control %s: %s", label, esp_err_to_name(err));
    } else {
        ESP_LOGD(TAG, "skipped control %s send: %s", label, esp_err_to_name(err));
    }
}

static cJSON *channel_array_json(const channel_list_t *channels)
{
    cJSON *array = cJSON_CreateArray();
    if (!array) {
        return NULL;
    }
    for (size_t i = 0; channels && i < channels->count; i++) {
        cJSON_AddItemToArray(array, cJSON_CreateNumber(channels->values[i]));
    }
    return array;
}

static void send_hello(void)
{
    uint16_t user_id = current_user_id();
    cJSON *root = cJSON_CreateObject();
    cJSON_AddStringToObject(root, "type", "hello");
    cJSON_AddNumberToObject(root, "user_id", user_id);
    cJSON_AddNumberToObject(root, "requested_user_id", CONFIG_INTERCOM_USER_ID);
    cJSON_AddStringToObject(root, "client_uid", s_client_uid);
    cJSON_AddStringToObject(root, "role", "client");

