gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
    cJSON *codecs = cJSON_CreateArray();
    cJSON_AddItemToArray(codecs, cJSON_CreateString("pcm16"));
    cJSON_AddItemToArray(codecs, cJSON_CreateString("pcm24"));
    cJSON_AddItemToArray(codecs, cJSON_CreateString("pcm48"));
    cJSON_AddItemToObject(root, "codecs", codecs);
    cJSON *codec_config = codec_config_json();
    if (codec_config) {
        cJSON_AddItemToObject(root, "codec_config", codec_config);
    }

    cJSON *buttons = cJSON_CreateArray();
    for (size_t i = 0; i < sizeof(s_dedicated_buttons) / sizeof(s_dedicated_buttons[0]); i++) {
        if (!physical_button_enabled(&s_dedicated_buttons[i])) {
            continue;
        }
        cJSON *button = cJSON_CreateObject();
        cJSON_AddStringToObject(button, "id", s_dedicated_buttons[i].id);
        cJSON_AddStringToObject(button, "label", s_dedicated_buttons[i].label);
        cJSON_AddItemToArray(buttons, button);
    }
    cJSON_AddItemToObject(root, "buttons", buttons);

    ESP_LOGI(TAG, "sending hello for user %u uid=%s", (unsigned)user_id, s_client_uid);
    log_control_send_result("hello", send_json(root), true);
    cJSON_Delete(root);
}

static void send_startup_config(void)
{
    cJSON *root = cJSON_CreateObject();
    cJSON_AddStringToObject(root, "type", "config");
    cJSON_AddNumberToObject(root, "user_id", current_user_id());
    cJSON_AddStringToObject(root, "role", "client");
    cJSON_AddStringToObject(root, "codec", codec_wire(runtime_codec_snapshot()));
    cJSON_AddStringToObject(root, "talk_mode", "ptt");

    xSemaphoreTake(s_config_lock, portMAX_DELAY);
    cJSON_AddItemToObject(root, "listen", channel_array_json(&s_config.listen));
    cJSON_AddItemToObject(root, "tx", channel_array_json(&s_config.tx));
    xSemaphoreGive(s_config_lock);
    cJSON_AddItemToObject(root, "vol", cJSON_CreateObject());

    ESP_LOGI(TAG, "server has no preconfig; seeding startup listen/TX defaults");
    log_control_send_result("startup config", send_json(root), true);
    cJSON_Delete(root);
}

static void send_talk_control(bool active)
{
    cJSON *root = cJSON_CreateObject();
    cJSON_AddStringToObject(root, "type", "talk");
    cJSON_AddNumberToObject(root, "user_id", current_user_id());
    cJSON_AddBoolToObject(root, "active", active);
    log_control_send_result("talk", send_json(root), true);
    cJSON_Delete(root);
}

static void send_button_control(const char *button_id, bool pressed)
{
    cJSON *root = cJSON_CreateObject();
    cJSON_AddStringToObject(root, "type", "button");
    cJSON_AddNumberToObject(root, "user_id", current_user_id());
    cJSON_AddStringToObject(root, "button_id", button_id);
    cJSON_AddBoolToObject(root, "pressed", pressed);
    log_control_send_result("button", send_json(root), true);
    cJSON_Delete(root);
}

static void send_ping(void)
{
    cJSON *root = cJSON_CreateObject();
    cJSON_AddStringToObject(root, "type", "ping");
    cJSON_AddNumberToObject(root, "user_id", current_user_id());
    log_control_send_result("ping", send_json(root), false);
    cJSON_Delete(root);
}

static void add_capture_channel_json(cJSON *root, const char *key, float rms, float peak, float dc_offset)
{
    cJSON *channel = cJSON_CreateObject();
    cJSON_AddNumberToObject(channel, "rms", rms);
    cJSON_AddNumberToObject(channel, "peak", peak);
    cJSON_AddNumberToObject(channel, "dc_offset", dc_offset);
    cJSON_AddItemToObject(root, key, channel);
}

static cJSON *codec_config_json(void)
{
    esp32_audio_config_t audio = audio_config_snapshot();
    ic_codec_t codec = runtime_codec_snapshot();
    cJSON *config = cJSON_CreateObject();
    if (!config) {
        return NULL;
    }
    cJSON_AddStringToObject(config, "chip", "es8388");
    cJSON_AddStringToObject(config, "active_codec", codec_wire(codec));
    cJSON_AddBoolToObject(config, "server_control_enabled", audio.server_control_enabled);
    cJSON_AddStringToObject(config, "adc_input", adc_input_name(audio.adc_input));
    cJSON_AddNumberToObject(config, "mic_pga_gain_db", audio.mic_pga_gain_db);
    cJSON_AddStringToObject(config, "capture_channel", capture_channel_name(audio.capture_channel));
    cJSON_AddNumberToObject(config, "mic_software_gain_percent", audio.mic_software_gain_percent);
    cJSON_AddNumberToObject(config, "speaker_software_gain_percent", audio.speaker_software_gain_percent);
    cJSON_AddNumberToObject(config, "notification_gain_percent", audio.notification_gain_percent);
    cJSON_AddBoolToObject(config, "high_pass_enabled", audio.high_pass_enabled);
    cJSON_AddBoolToObject(config, "alc_enabled", false);
    cJSON_AddBoolToObject(config, "noise_gate_enabled", false);
    cJSON_AddStringToObject(config, "audio_backend", "legacy_i2s_es8388");
    cJSON_AddNumberToObject(config, "hardware_sample_rate_hz", ESP32_AUDIO_HW_SAMPLE_RATE);
    cJSON_AddNumberToObject(config, "hardware_channels", ESP32_AUDIO_HW_CHANNELS);
    cJSON_AddNumberToObject(config, "hardware_bits_per_sample", ESP32_AUDIO_HW_BITS_PER_SAMPLE);
    cJSON_AddNumberToObject(config, "i2s_sample_rate_hz", ESP32_AUDIO_HW_SAMPLE_RATE);
    cJSON_AddStringToObject(config, "i2s_format", i2s_format_name());
    cJSON_AddStringToObject(config, "i2s_slot_width", i2s_slot_width_name());

    cJSON *sidetone = cJSON_CreateObject();
    if (sidetone) {
        cJSON_AddStringToObject(sidetone, "mode", sidetone_mode_name(audio.sidetone_mode));
        cJSON_AddNumberToObject(sidetone, "firmware_gain_percent", audio.sidetone_firmware_gain_percent);
        cJSON_AddNumberToObject(sidetone, "codec_bypass_gain_percent", audio.sidetone_codec_bypass_gain_percent);
        cJSON_AddNumberToObject(sidetone, "mic_bypass_gain_percent", audio.sidetone_mic_bypass_gain_percent);
        cJSON_AddBoolToObject(sidetone, "codec_bypass_available", false);
        cJSON_AddStringToObject(sidetone, "active_bypass_source", "none");
        cJSON_AddBoolToObject(sidetone, "codec_bypass_preserves_dac", true);
        cJSON_AddItemToObject(config, "sidetone", sidetone);
    }
    return config;
}

static void send_capture_health(void)
{
    capture_health_report_t report;
    taskENTER_CRITICAL(&s_capture_health_lock);
    report = s_capture_health_report;
    s_capture_health_report.ready = false;
    taskEXIT_CRITICAL(&s_capture_health_lock);

