gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
    if (!report.ready || !websocket_ready()) {
        return;
    }

    cJSON *root = cJSON_CreateObject();
    cJSON_AddStringToObject(root, "type", "capture_health");
    cJSON_AddNumberToObject(root, "user_id", current_user_id());

    cJSON *health = cJSON_CreateObject();
    esp32_audio_config_t audio = audio_config_snapshot();
    cJSON *codec_config = codec_config_json();
    if (codec_config) {
        cJSON_AddItemToObject(health, "codec_config", codec_config);
    }
    cJSON_AddStringToObject(health, "adc_input", adc_input_name(audio.adc_input));
    cJSON_AddNumberToObject(health, "mic_pga_gain_db", audio.mic_pga_gain_db);
    cJSON_AddStringToObject(health, "capture_channel", capture_channel_name(audio.capture_channel));
    cJSON_AddNumberToObject(health, "software_gain_percent", audio.mic_software_gain_percent);
    cJSON_AddBoolToObject(health, "high_pass_enabled", audio.high_pass_enabled);
    cJSON_AddBoolToObject(health, "alc_enabled", false);
    cJSON_AddBoolToObject(health, "noise_gate_enabled", false);
    add_capture_channel_json(health, "left", report.left_rms, report.left_peak, report.left_dc_offset);
    add_capture_channel_json(health, "right", report.right_rms, report.right_peak, report.right_dc_offset);
    add_capture_channel_json(health,
                             "selected",
                             report.selected_rms,
                             report.selected_peak,
                             report.selected_dc_offset);
    size_t playback_queue_depth = 0;
    uint32_t playback_underflows = 0;
    uint32_t playback_overflows = 0;
    ic_pcm_frame_ring_stats(&s_playback_ring, &playback_queue_depth, &playback_underflows, &playback_overflows);
    cJSON_AddNumberToObject(health, "playback_queue_depth", playback_queue_depth);
    cJSON_AddNumberToObject(health, "playback_underflows", playback_underflows);
    cJSON_AddNumberToObject(health, "playback_overflows", playback_overflows);
    cJSON_AddNumberToObject(health, "playback_i2s_gap_warnings", s_audio_hw_write_gap_warnings);
    cJSON_AddNumberToObject(health, "playback_i2s_slow_warnings", s_audio_hw_write_slow_warnings);
    cJSON_AddNumberToObject(health, "playback_i2s_short_warnings", s_audio_hw_write_short_warnings);
    cJSON_AddNumberToObject(health, "free_heap_bytes", esp_get_free_heap_size());
    cJSON_AddNumberToObject(health, "min_free_heap_bytes", esp_get_minimum_free_heap_size());
    cJSON_AddNumberToObject(health, "raw_clipped_samples", report.raw_clipped_samples);
    cJSON_AddNumberToObject(health, "software_clipped_samples", report.software_clipped_samples);
    cJSON_AddNumberToObject(health, "tx_target_count", report.tx_target_count);
    cJSON_AddNumberToObject(health, "tx_packets_sent", report.tx_packets_sent);
    cJSON_AddNumberToObject(health, "tx_send_failures", report.tx_send_failures);
    cJSON_AddItemToObject(root, "health", health);

    log_control_send_result("capture health", send_json(root), false);
    cJSON_Delete(root);
}

static void parse_json_channel_array(cJSON *array, channel_list_t *out)
{
    memset(out, 0, sizeof(*out));
    cJSON *item = NULL;
    cJSON_ArrayForEach(item, array) {
        if (cJSON_IsNumber(item) && item->valuedouble > 0 && item->valuedouble <= UINT16_MAX) {
            channel_list_add(out, (uint16_t)item->valuedouble);
        }
    }
}

static void parse_json_user_array(cJSON *array, user_list_t *out)
{
    memset(out, 0, sizeof(*out));
    cJSON *item = NULL;
    cJSON_ArrayForEach(item, array) {
        if (cJSON_IsNumber(item) && item->valuedouble > 0 && item->valuedouble <= UINT16_MAX) {
            user_list_add(out, (uint16_t)item->valuedouble);
        }
    }
}

static bool active_buttons_contains(cJSON *active_buttons, const char *id)
{
    cJSON *item = NULL;
    cJSON_ArrayForEach(item, active_buttons) {
        if (cJSON_IsString(item) && string_eq(cJSON_GetStringValue(item), id)) {
            return true;
        }
    }
    return false;
}

static bool parse_adc_input_value(const char *value, esp32_adc_input_t *out)
{
    if (string_eq(value, "mic1")) {
        *out = ESP32_ADC_MIC1;
    } else if (string_eq(value, "mic2")) {
        *out = ESP32_ADC_MIC2;
    } else if (string_eq(value, "line1")) {
        *out = ESP32_ADC_LINE1;
    } else if (string_eq(value, "line2")) {
        *out = ESP32_ADC_LINE2;
    } else if (string_eq(value, "difference")) {
        *out = ESP32_ADC_DIFFERENCE;
    } else {
        return false;
    }
    return true;
}

static bool parse_capture_channel_value(const char *value, esp32_capture_channel_t *out)
{
    if (string_eq(value, "right")) {
        *out = ESP32_CAPTURE_RIGHT;
    } else if (string_eq(value, "average")) {
        *out = ESP32_CAPTURE_AVERAGE;
    } else if (string_eq(value, "left")) {
        *out = ESP32_CAPTURE_LEFT;
    } else {
        return false;
    }
    return true;
}

static bool parse_sidetone_mode_value(const char *value, esp32_sidetone_mode_t *out)
{
    if (string_eq(value, "firmware")) {
        *out = ESP32_SIDETONE_FIRMWARE;
    } else if (string_eq(value, "codec_bypass")) {
        *out = ESP32_SIDETONE_CODEC_BYPASS;
    } else if (string_eq(value, "off")) {
        *out = ESP32_SIDETONE_OFF;
    } else {
        return false;
    }
    return true;
}

static uint16_t json_u16_or(cJSON *object, const char *key, uint16_t fallback, uint16_t max)
{
    cJSON *item = cJSON_GetObjectItem(object, key);
    if (!cJSON_IsNumber(item)) {
        return fallback;
    }
    int value = (int)item->valuedouble;
    if (value < 0) {
        return 0;
    }
    if (value > max) {
        return max;
    }
    return (uint16_t)value;
}

static bool parse_esp32_audio_config(cJSON *object, esp32_audio_config_t *out)
{
    if (!cJSON_IsObject(object) || !out) {
        return false;
    }

    esp32_audio_config_t next = default_audio_config();
    cJSON *enabled = cJSON_GetObjectItem(object, "enabled");
    if (!cJSON_IsBool(enabled) || !cJSON_IsTrue(enabled)) {
        *out = next;
        return true;
    }
    next.server_control_enabled = true;

    cJSON *adc_input = cJSON_GetObjectItem(object, "adc_input");
    if (cJSON_IsString(adc_input)) {
        parse_adc_input_value(cJSON_GetStringValue(adc_input), &next.adc_input);
    }

    next.mic_pga_gain_db = (uint8_t)((json_u16_or(object, "mic_pga_gain_db", next.mic_pga_gain_db, 24) / 3) * 3);

    cJSON *capture_channel = cJSON_GetObjectItem(object, "capture_channel");
    if (cJSON_IsString(capture_channel)) {
        parse_capture_channel_value(cJSON_GetStringValue(capture_channel), &next.capture_channel);
    }

    next.mic_software_gain_percent =
        json_u16_or(object, "mic_software_gain_percent", next.mic_software_gain_percent, 400);
    next.speaker_software_gain_percent =
        json_u16_or(object, "speaker_software_gain_percent", next.speaker_software_gain_percent, 400);
    next.notification_gain_percent =
        json_u16_or(object, "notification_gain_percent", next.notification_gain_percent, 200);
    cJSON *high_pass = cJSON_GetObjectItem(object, "high_pass_enabled");
    if (cJSON_IsBool(high_pass)) {
        next.high_pass_enabled = cJSON_IsTrue(high_pass);
    }
    cJSON *alc = cJSON_GetObjectItem(object, "alc_enabled");
    if (cJSON_IsBool(alc)) {
        next.alc_enabled = cJSON_IsTrue(alc);
    }
    cJSON *noise_gate = cJSON_GetObjectItem(object, "noise_gate_enabled");
    if (cJSON_IsBool(noise_gate)) {
        next.noise_gate_enabled = cJSON_IsTrue(noise_gate);
    }

    cJSON *sidetone = cJSON_GetObjectItem(object, "sidetone");
    if (cJSON_IsObject(sidetone)) {
        cJSON *mode = cJSON_GetObjectItem(sidetone, "mode");
        if (cJSON_IsString(mode)) {
            parse_sidetone_mode_value(cJSON_GetStringValue(mode), &next.sidetone_mode);
        }
        next.sidetone_firmware_gain_percent =
            json_u16_or(sidetone, "firmware_gain_percent", next.sidetone_firmware_gain_percent, 200);
        next.sidetone_codec_bypass_gain_percent =
            json_u16_or(sidetone, "codec_bypass_gain_percent", next.sidetone_codec_bypass_gain_percent, 200);
        next.sidetone_mic_bypass_gain_percent =
            json_u16_or(sidetone, "mic_bypass_gain_percent", next.sidetone_mic_bypass_gain_percent, 400);
    }
    if (next.sidetone_mode == ESP32_SIDETONE_CODEC_BYPASS) {
        next.sidetone_mode = ESP32_SIDETONE_OFF;
    }

