gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
    *out = next;
    return true;
}

static void apply_config_update(cJSON *root)
{
    cJSON *user_id = cJSON_GetObjectItem(root, "user_id");
    if (!cJSON_IsNumber(user_id) || (uint16_t)user_id->valuedouble != current_user_id()) {
        return;
    }

    runtime_config_t next;
    xSemaphoreTake(s_config_lock, portMAX_DELAY);
    next = s_config;
    xSemaphoreGive(s_config_lock);

    parse_json_channel_array(cJSON_GetObjectItem(root, "listen"), &next.listen);
    parse_json_channel_array(cJSON_GetObjectItem(root, "tx"), &next.tx);

    cJSON *codec = cJSON_GetObjectItem(root, "codec");
    if (cJSON_IsString(codec)) {
        ic_codec_t parsed_codec = next.codec;
        if (parse_codec_value(cJSON_GetStringValue(codec), &parsed_codec) && codec_supported(parsed_codec)) {
            next.codec = parsed_codec;
        } else {
            ESP_LOGW(TAG, "ignoring unsupported codec in config_update: %s", cJSON_GetStringValue(codec));
        }
    }

    cJSON *mode = cJSON_GetObjectItem(root, "talk_mode");
    if (cJSON_IsString(mode)) {
        next.talk_mode = parse_talk_mode(cJSON_GetStringValue(mode));
    }
    cJSON *regular = cJSON_GetObjectItem(root, "regular_talk_active");
    if (cJSON_IsBool(regular)) {
        next.regular_talk_active = cJSON_IsTrue(regular);
    }

    next.button_count = 0;
    cJSON *buttons = cJSON_GetObjectItem(root, "buttons");
    cJSON *active_buttons = cJSON_GetObjectItem(root, "active_buttons");
    cJSON *button = NULL;
    cJSON_ArrayForEach(button, buttons) {
        if (next.button_count >= MAX_BUTTONS) {
            break;
        }
        cJSON *id = cJSON_GetObjectItem(button, "id");
        if (!cJSON_IsString(id)) {
            continue;
        }

        button_route_t *route = &next.buttons[next.button_count++];
        memset(route, 0, sizeof(*route));
        strlcpy(route->id, cJSON_GetStringValue(id), sizeof(route->id));
        cJSON *label = cJSON_GetObjectItem(button, "label");
        strlcpy(route->label, cJSON_IsString(label) ? cJSON_GetStringValue(label) : route->id, sizeof(route->label));
        cJSON *button_mode = cJSON_GetObjectItem(button, "mode");
        route->latching = cJSON_IsString(button_mode) && string_eq(cJSON_GetStringValue(button_mode), "latching");
        route->active = active_buttons_contains(active_buttons, route->id);

        cJSON *actions = cJSON_GetObjectItem(button, "actions");
        cJSON *action = NULL;
        cJSON_ArrayForEach(action, actions) {
            cJSON *type = cJSON_GetObjectItem(action, "type");
            if (!cJSON_IsString(type) || !string_eq(cJSON_GetStringValue(type), "transmit")) {
                continue;
            }
            parse_json_channel_array(cJSON_GetObjectItem(action, "channels"), &route->tx_channels);
            parse_json_user_array(cJSON_GetObjectItem(action, "users"), &route->tx_users);
            route->duck = cJSON_IsTrue(cJSON_GetObjectItem(action, "duck"));
            break;
        }
    }

    esp32_audio_config_t audio_next;
    bool has_audio_config = parse_esp32_audio_config(cJSON_GetObjectItem(root, "esp32_audio"), &audio_next);
    if (has_audio_config) {
        esp32_audio_config_t audio_current = audio_config_snapshot();
        if (!audio_config_equal(&audio_current, &audio_next)) {
            audio_config_store(&audio_next);
            request_audio_config_apply(&audio_next);
        }
    }

    xSemaphoreTake(s_config_lock, portMAX_DELAY);
    ic_codec_t previous_codec = s_config.codec;
    s_config = next;
    xSemaphoreGive(s_config_lock);

    if (previous_codec != next.codec) {
        esp_err_t err = audio_i2s_set_codec(next.codec);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "failed to switch I2S codec to %s: %s", codec_wire(next.codec), esp_err_to_name(err));
        }
    }

    ESP_LOGI(TAG,
             "config update: listen=%u tx=%u codec=%s mode=%s buttons=%u",
             (unsigned)next.listen.count,
             (unsigned)next.tx.count,
             codec_wire(next.codec),
             talk_mode_wire(next.talk_mode),
             (unsigned)next.button_count);
}

static void handle_control_json(const char *text, size_t len)
{
    cJSON *root = cJSON_ParseWithLength(text, len);
    if (!root) {
        ESP_LOGW(TAG, "invalid control JSON (%u bytes)", (unsigned)len);
        return;
    }

    cJSON *type = cJSON_GetObjectItem(root, "type");
    if (!cJSON_IsString(type)) {
        cJSON_Delete(root);
        return;
    }

    const char *type_text = cJSON_GetStringValue(type);
    if (string_eq(type_text, "hello")) {
        cJSON *assigned_user_id = cJSON_GetObjectItem(root, "user_id");
        if (cJSON_IsNumber(assigned_user_id)) {
            set_current_user_id((uint16_t)assigned_user_id->valuedouble);
        }
        cJSON *returned_uid = cJSON_GetObjectItem(root, "client_uid");
        if (cJSON_IsString(returned_uid) && cJSON_GetStringValue(returned_uid)[0] != '\0') {
            strlcpy(s_client_uid, cJSON_GetStringValue(returned_uid), sizeof(s_client_uid));
        }
        cJSON *enrollment = cJSON_GetObjectItem(root, "enrollment");
        if (cJSON_IsString(enrollment) && !string_eq(cJSON_GetStringValue(enrollment), "enrolled")) {
            ESP_LOGW(TAG,
                     "server enrollment status is %s; waiting for admin approval and not seeding startup config",
                     cJSON_GetStringValue(enrollment));
            cJSON_Delete(root);
            return;
        }
        if (!cJSON_IsTrue(cJSON_GetObjectItem(root, "preconfigured"))) {
            control_request_startup_config();
        }
    } else if (string_eq(type_text, "config_update")) {
        apply_config_update(root);
    } else if (string_eq(type_text, "error")) {
        cJSON *message = cJSON_GetObjectItem(root, "message");
        ESP_LOGW(TAG, "server control error: %s", cJSON_IsString(message) ? cJSON_GetStringValue(message) : "unknown");
    }

    cJSON_Delete(root);
}

static void reset_control_rx_buffer(void)
{
    s_control_rx_expected_len = 0;
    s_control_rx_received_len = 0;
}

