gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
static void handle_control_ws_data(const esp_websocket_event_data_t *data)
{
    if (!data || !data->data_ptr || data->data_len <= 0) {
        return;
    }
    if (data->op_code != 0x1 && data->op_code != 0x0) {
        return;
    }

    size_t payload_len = data->payload_len > 0 ? (size_t)data->payload_len : (size_t)data->data_len;
    size_t offset = data->payload_offset >= 0 ? (size_t)data->payload_offset : 0;
    size_t data_len = (size_t)data->data_len;

    if (payload_len > CONTROL_RX_MAX_BYTES || offset + data_len > CONTROL_RX_MAX_BYTES ||
        offset + data_len > payload_len) {
        ESP_LOGW(TAG,
                 "dropping oversized control websocket message: payload=%u offset=%u chunk=%u max=%u",
                 (unsigned)payload_len,
                 (unsigned)offset,
                 (unsigned)data_len,
                 (unsigned)CONTROL_RX_MAX_BYTES);
        reset_control_rx_buffer();
        return;
    }

    if (offset == 0) {
        s_control_rx_expected_len = payload_len;
        s_control_rx_received_len = 0;
    } else if (s_control_rx_expected_len != payload_len || offset != s_control_rx_received_len) {
        ESP_LOGW(TAG,
                 "dropping out-of-order control websocket fragment: payload=%u offset=%u received=%u",
                 (unsigned)payload_len,
                 (unsigned)offset,
                 (unsigned)s_control_rx_received_len);
        reset_control_rx_buffer();
        return;
    }

    memcpy(s_control_rx_buffer + offset, data->data_ptr, data_len);
    s_control_rx_received_len = offset + data_len;

    if (s_control_rx_received_len < s_control_rx_expected_len) {
        ESP_LOGD(TAG,
                 "buffered control websocket fragment: %u/%u bytes",
                 (unsigned)s_control_rx_received_len,
                 (unsigned)s_control_rx_expected_len);
        return;
    }

    s_control_rx_buffer[s_control_rx_expected_len] = '\0';
    handle_control_json(s_control_rx_buffer, s_control_rx_expected_len);
    reset_control_rx_buffer();
}

static void websocket_event_handler(void *handler_args,
                                    esp_event_base_t base,
                                    int32_t event_id,
                                    void *event_data)
{
    (void)handler_args;
    (void)base;
    esp_websocket_event_data_t *data = (esp_websocket_event_data_t *)event_data;

    switch (event_id) {
    case WEBSOCKET_EVENT_CONNECTED:
        ESP_LOGI(TAG, "control connected");
        control_connected_set(true);
        audio_cue_replace(AUDIO_CUE_CONNECTED);
        break;
    case WEBSOCKET_EVENT_DISCONNECTED:
        ESP_LOGW(TAG, "control disconnected");
        control_connected_set(false);
        audio_cue_replace(AUDIO_CUE_DISCONNECTED);
        reset_control_rx_buffer();
        break;
    case WEBSOCKET_EVENT_DATA:
        handle_control_ws_data(data);
        break;
    case WEBSOCKET_EVENT_ERROR:
        ESP_LOGW(TAG, "control websocket error");
        control_connected_set(false);
        break;
    default:
        break;
    }
}

static void wifi_event_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data)
{
    (void)arg;
    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
        esp_wifi_connect();
    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED) {
        xEventGroupClearBits(s_wifi_events, WIFI_CONNECTED_BIT);
        ESP_LOGW(TAG, "Wi-Fi disconnected; reconnecting");
        esp_wifi_connect();
    } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t *event = (ip_event_got_ip_t *)event_data;
        ESP_LOGI(TAG, "Wi-Fi connected: " IPSTR, IP2STR(&event->ip_info.ip));
        esp_wifi_set_ps(WIFI_PS_NONE);
        xEventGroupSetBits(s_wifi_events, WIFI_CONNECTED_BIT);
    }
}

static void wifi_init(void)
{
    s_wifi_events = xEventGroupCreate();
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    esp_netif_create_default_wifi_sta();

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));
    ESP_ERROR_CHECK(esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID, wifi_event_handler, NULL, NULL));
    ESP_ERROR_CHECK(esp_event_handler_instance_register(IP_EVENT, IP_EVENT_STA_GOT_IP, wifi_event_handler, NULL, NULL));

    wifi_config_t wifi_config = {0};
    strlcpy((char *)wifi_config.sta.ssid, CONFIG_INTERCOM_WIFI_SSID, sizeof(wifi_config.sta.ssid));
    strlcpy((char *)wifi_config.sta.password, CONFIG_INTERCOM_WIFI_PASSWORD, sizeof(wifi_config.sta.password));
    wifi_config.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK;

    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));
    ESP_ERROR_CHECK(esp_wifi_start());
}

static esp_err_t resolve_server(struct sockaddr_storage *out, socklen_t *out_len, uint16_t port)
{
    char port_text[8];
    snprintf(port_text, sizeof(port_text), "%u", port);
    struct addrinfo hints = {
        .ai_family = AF_INET,
        .ai_socktype = SOCK_DGRAM,
    };
    struct addrinfo *res = NULL;
    int rc = getaddrinfo(CONFIG_INTERCOM_SERVER_HOST, port_text, &hints, &res);
    if (rc != 0 || !res) {
        return ESP_FAIL;
    }
    memcpy(out, res->ai_addr, res->ai_addrlen);
    *out_len = res->ai_addrlen;
    freeaddrinfo(res);
    return ESP_OK;
}

static void websocket_start(void)
{
    char uri[160];
    snprintf(uri, sizeof(uri), "ws://%s:%d", CONFIG_INTERCOM_SERVER_HOST, CONFIG_INTERCOM_CONTROL_PORT);
    esp_websocket_client_config_t config = {
        .uri = uri,
        .reconnect_timeout_ms = 2000,
        .network_timeout_ms = 5000,
        .task_core_id_set = true,
        .task_core_id = task_core(CONFIG_INTERCOM_NET_TASK_CORE),
        .task_prio = 5,
        .task_name = "ic_ws",
        .task_stack = 6144,
        .buffer_size = 2048,
        .keep_alive_enable = true,
        .keep_alive_idle = 10,
        .keep_alive_interval = 5,
        .keep_alive_count = 3,
    };
    control_connected_set(false);
    s_ws_client = esp_websocket_client_init(&config);
    ESP_ERROR_CHECK(esp_websocket_register_events(s_ws_client, WEBSOCKET_EVENT_ANY, websocket_event_handler, NULL));
    ESP_ERROR_CHECK(esp_websocket_client_start(s_ws_client));
}

static esp_err_t i2c_init(void)
{
    i2c_master_bus_config_t bus_config = {
        .i2c_port = I2C_NUM_0,
        .sda_io_num = CONFIG_INTERCOM_I2C_SDA_GPIO,
        .scl_io_num = CONFIG_INTERCOM_I2C_SCL_GPIO,
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .glitch_ignore_cnt = 7,
        .flags = {
            .enable_internal_pullup = true,
        },
    };
    return i2c_new_master_bus(&bus_config, &s_i2c_bus);
}

static bool audio_hw_i2c_probe_addr(uint8_t address)
{
    if (!s_i2c_bus) {
        return false;
    }
    return i2c_master_probe(s_i2c_bus, address, 60) == ESP_OK;
}

static esp_err_t audio_hw_probe_codec(void)
{
    bool found_any = false;
    char devices[128] = {0};
    size_t used = 0;
    for (uint8_t address = 0x08; address <= 0x77; address++) {
        if (!audio_hw_i2c_probe_addr(address)) {
            continue;
        }
        found_any = true;
        if (used + 6 < sizeof(devices)) {
            int written = snprintf(devices + used, sizeof(devices) - used, "%s0x%02x", used ? "," : "", address);
            if (written > 0) {
                used += (size_t)written < sizeof(devices) - used ? (size_t)written : sizeof(devices) - used - 1;
            }
        }
    }

    ESP_LOGW(TAG, "I2C probe devices: %s", found_any ? devices : "none");
    bool es8388_present = audio_hw_i2c_probe_addr(ES8388_ADDR);
    bool ac101_present = audio_hw_i2c_probe_addr(AC101_ADDR);
    if (es8388_present) {
        ESP_LOGI(TAG, "codec probe: device answered at 0x%02x, expected ES8388 address", ES8388_ADDR);
    }
    if (ac101_present) {
        ESP_LOGE(TAG,
                 "codec probe: device answered at 0x%02x, common AC101 address; this firmware currently supports "
                 "ES8388 only",
                 AC101_ADDR);
    }
    if (!es8388_present) {
        ESP_LOGE(TAG,
                 "codec probe: no device answered at ES8388 address 0x%02x; check whether this is an AC101 board, "
                 "a different board revision, or an I2C wiring/pin issue",
                 ES8388_ADDR);
        return ESP_ERR_NOT_FOUND;
    }
    if (ac101_present) {
        ESP_LOGW(TAG,
                 "codec probe: both ES8388 and AC101 addresses responded; continuing with ES8388 init but board "
                 "identity should be verified visually");
    }
    return ESP_OK;
}

