gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
static esp_err_t audio_hw_apply_audio_config(const esp32_audio_config_t *config)
{
    if (!s_i2c_codec_dev || !config) {
        return ESP_ERR_INVALID_STATE;
    }
    int output_volume = config->speaker_software_gain_percent;
    if (output_volume > 100) {
        output_volume = 100;
    }
    uint8_t pga = config->mic_pga_gain_db / 3;
    if (pga > 0x0f) {
        pga = 0x0f;
    }
    uint8_t pga_reg = (uint8_t)((pga << 4) | pga);
    uint8_t out_volume = output_volume == 0 ? ES8388_OUTPUT_VOLUME_MUTE : ES8388_OUTPUT_VOLUME_0DB;

    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_ADCCONTROL1, pga_reg, "ADCCONTROL1 mic PGA"),
                        TAG,
                        "set ES8388 mic PGA");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_ADCCONTROL2,
                                                  es8388_adc_input_value(config->adc_input),
                                                  "ADCCONTROL2 ADC input"),
                        TAG,
                        "set ES8388 ADC input");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL24, out_volume, "DACCONTROL24 LOUT1"),
                        TAG,
                        "set LOUT1 volume");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL25, out_volume, "DACCONTROL25 ROUT1"),
                        TAG,
                        "set ROUT1 volume");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL26, out_volume, "DACCONTROL26 LOUT2"),
                        TAG,
                        "set LOUT2 volume");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL27, out_volume, "DACCONTROL27 ROUT2"),
                        TAG,
                        "set ROUT2 volume");
    if (config->sidetone_mode == ESP32_SIDETONE_CODEC_BYPASS) {
        ESP_LOGW(TAG, "codec-bypass sidetone is disabled in legacy bring-up; use firmware sidetone instead");
    }
    if (config->alc_enabled || config->noise_gate_enabled) {
        ESP_LOGW(TAG, "legacy ES8388 bring-up ignores ALC/noise-gate register overrides for now");
    }
    ESP_LOGI(TAG,
             "applied legacy ES8388 audio config: output_volume=%d driver_volume=0x%02x input_gain=%u dB "
             "mic_pga_reg=0x%02x mic_software_gain=%u%% "
             "capture_channel=%s high_pass=%s sidetone=%s",
             output_volume,
             out_volume,
             config->mic_pga_gain_db,
             pga_reg,
             config->mic_software_gain_percent,
             capture_channel_name(config->capture_channel),
             config->high_pass_enabled ? "on" : "off",
             sidetone_mode_name(config->sidetone_mode));
    return ESP_OK;
}

static esp_err_t audio_hw_write_es8388_reg(int reg, int value, const char *name)
{
    if (!s_i2c_codec_dev) {
        return ESP_ERR_INVALID_STATE;
    }
    uint8_t data[2] = {(uint8_t)(reg & 0xff), (uint8_t)(value & 0xff)};
    esp_err_t ret = i2c_master_transmit(s_i2c_codec_dev, data, sizeof(data), 100);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG,
                 "failed to write %s reg 0x%02x = 0x%02x: %s",
                 name,
                 reg,
                 value,
                 esp_err_to_name(ret));
        return ret;
    }
    return ESP_OK;
}

static esp_err_t audio_hw_read_es8388_reg_value(int reg, int *value, const char *name)
{
    if (!s_i2c_codec_dev || !value) {
        return ESP_ERR_INVALID_STATE;
    }
    uint8_t reg_addr = (uint8_t)(reg & 0xff);
    uint8_t data = 0;
    esp_err_t ret = i2c_master_transmit_receive(s_i2c_codec_dev, &reg_addr, 1, &data, 1, 100);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "failed to read %s reg 0x%02x: %s", name, reg, esp_err_to_name(ret));
        return ret;
    }
    *value = data;
    return ESP_OK;
}

static esp_err_t audio_hw_update_es8388_reg_bits(int reg, int clear_mask, int set_bits, const char *name)
{
    int value = 0;
    ESP_RETURN_ON_ERROR(audio_hw_read_es8388_reg_value(reg, &value, name), TAG, "read ES8388 register");
    value = (value & ~clear_mask) | set_bits;
    return audio_hw_write_es8388_reg(reg, value, name);
}

static void audio_hw_log_es8388_reg(int reg, const char *name)
{
    int value = 0;
    esp_err_t ret = audio_hw_read_es8388_reg_value(reg, &value, name);
    if (ret != ESP_OK) {
        return;
    }
    ESP_LOGI(TAG, "  %s reg 0x%02x = 0x%02x", name, reg, value & 0xff);
}

static esp_err_t audio_hw_set_pa_gpio_level(bool high)
{
#if CONFIG_INTERCOM_PA_ENABLE_GPIO >= 0
    if (!GPIO_IS_VALID_OUTPUT_GPIO(CONFIG_INTERCOM_PA_ENABLE_GPIO)) {
        ESP_LOGW(TAG, "PA GPIO %d cannot be driven as an output", CONFIG_INTERCOM_PA_ENABLE_GPIO);
        return ESP_ERR_INVALID_ARG;
    }
    ESP_RETURN_ON_ERROR(gpio_set_direction((gpio_num_t)CONFIG_INTERCOM_PA_ENABLE_GPIO, GPIO_MODE_OUTPUT),
                        TAG,
                        "configure diagnostic PA GPIO");
    ESP_RETURN_ON_ERROR(gpio_set_level((gpio_num_t)CONFIG_INTERCOM_PA_ENABLE_GPIO, high ? 1 : 0),
                        TAG,
                        "set diagnostic PA GPIO");
    ESP_LOGW(TAG, "diagnostic PA GPIO %d forced %s", CONFIG_INTERCOM_PA_ENABLE_GPIO, high ? "high" : "low");
    return ESP_OK;
#else
    (void)high;
    ESP_LOGW(TAG, "diagnostic PA GPIO disabled");
    return ESP_OK;
#endif
}

static esp_err_t audio_hw_apply_output_registers(const char *label,
                                                 uint8_t dac_power,
                                                 uint8_t out1_volume,
                                                 uint8_t out2_volume,
                                                 bool log_readback)
{
    if (!s_i2c_codec_dev) {
        return ESP_ERR_INVALID_STATE;
    }

    ESP_LOGI(TAG,
             "applying ES8388 output profile: %s DACPOWER=0x%02x OUT1=0x%02x OUT2=0x%02x",
             label ? label : "custom",
             dac_power,
             out1_volume,
             out2_volume);
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACPOWER, dac_power, "DACPOWER"),
                        TAG,
                        "set ES8388 output power route");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL24, out1_volume, "DACCONTROL24 LOUT1"),
                        TAG,
                        "set LOUT1 route volume");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL25, out1_volume, "DACCONTROL25 ROUT1"),
                        TAG,
                        "set ROUT1 route volume");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL26, out2_volume, "DACCONTROL26 LOUT2"),
                        TAG,
                        "set LOUT2 route volume");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL27, out2_volume, "DACCONTROL27 ROUT2"),
                        TAG,
                        "set ROUT2 route volume");

    if (log_readback) {
        ESP_LOGI(TAG, "ES8388 output profile readback for %s:", label ? label : "custom");
        audio_hw_log_es8388_reg(ES8388_DACPOWER, "DACPOWER");
        audio_hw_log_es8388_reg(ES8388_DACCONTROL24, "DACCONTROL24 LOUT1");
        audio_hw_log_es8388_reg(ES8388_DACCONTROL25, "DACCONTROL25 ROUT1");
        audio_hw_log_es8388_reg(ES8388_DACCONTROL26, "DACCONTROL26 LOUT2");
        audio_hw_log_es8388_reg(ES8388_DACCONTROL27, "DACCONTROL27 ROUT2");
        audio_hw_log_es8388_reg(ES8388_DACCONTROL3, "DACCONTROL3 mute");
    }
    return ESP_OK;
}

static esp_err_t audio_hw_apply_output_route(esp32_output_route_t route, bool log_readback)
{
    uint8_t dac_power = ES8388_DACPOWER_ENABLE_ALL_OUTPUTS;
    uint8_t out1_volume = ES8388_OUTPUT_VOLUME_0DB;
    uint8_t out2_volume = ES8388_OUTPUT_VOLUME_0DB;
    switch (route) {
    case ESP32_OUTPUT_ROUTE_OUT1:
        dac_power = ES8388_DACPOWER_ENABLE_OUT1;
        out2_volume = ES8388_OUTPUT_VOLUME_MUTE;
        break;
    case ESP32_OUTPUT_ROUTE_OUT2:
        dac_power = ES8388_DACPOWER_ENABLE_OUT2;
        out1_volume = ES8388_OUTPUT_VOLUME_MUTE;
        break;
    case ESP32_OUTPUT_ROUTE_BOTH:
    default:
        break;
    }

    return audio_hw_apply_output_registers(output_route_name(route),
                                           dac_power,
                                           out1_volume,
                                           out2_volume,
                                           log_readback);
}

