gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
static esp_err_t audio_hw_init(void)
{
    if (!s_i2c_bus) {
        return ESP_ERR_INVALID_STATE;
    }

    if (!s_i2c_codec_dev) {
        i2c_device_config_t dev_cfg = {
            .dev_addr_length = I2C_ADDR_BIT_LEN_7,
            .device_address = ES8388_ADDR,
            .scl_speed_hz = 100000,
        };
        ESP_RETURN_ON_ERROR(i2c_master_bus_add_device(s_i2c_bus, &dev_cfg, &s_i2c_codec_dev),
                            TAG,
                            "add ES8388 I2C device");
    }

    ESP_LOGI(TAG, "initializing ES8388 codec with legacy register sequence at I2C address 0x%02x", ES8388_ADDR);
    s_audio_hw_ready = false;
    int fmt = s_i2s_options.msb_format ? 1 : 0;

    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL3,
                                                  ES8388_DACCONTROL3_DAC_MUTE,
                                                  "DACCONTROL3 mute"),
                        TAG,
                        "mute ES8388 during init");
    codec_output_mute_state_set(true);
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_CONTROL1, 0x12, "CONTROL1"), TAG, "ES8388 CONTROL1");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_CONTROL2, 0x50, "CONTROL2"), TAG, "ES8388 CONTROL2");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_CHIPPOWER, 0x00, "CHIPPOWER"), TAG, "ES8388 CHIPPOWER");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_MASTERMODE, 0x00, "MASTERMODE"), TAG, "ES8388 slave mode");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACPOWER,
                                                  ES8388_DACPOWER_DISABLE_OUTPUTS,
                                                  "DACPOWER"),
                        TAG,
                        "disable ES8388 outputs during init");

    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL1, 0x18 | (fmt << 1), "DACCONTROL1"),
                        TAG,
                        "set ES8388 DAC format");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL2, 0x02, "DACCONTROL2"), TAG, "ES8388 DAC ratio");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL4, 0x00, "DACCONTROL4 left DAC volume"),
                        TAG,
                        "set left DAC volume");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL5, 0x00, "DACCONTROL5 right DAC volume"),
                        TAG,
                        "set right DAC volume");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL16,
                                                  ES8388_MIXSEL_LINE2,
                                                  "DACCONTROL16 mixer select"),
                        TAG,
                        "set Audio Kit mixer select");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL17, ES8388_MIXER_DAC_0DB, "DACCONTROL17"),
                        TAG,
                        "set left DAC mixer");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL18, 0x28, "DACCONTROL18"), TAG, "ES8388 mixer");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL19, 0x28, "DACCONTROL19"), TAG, "ES8388 mixer");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL20, ES8388_MIXER_DAC_0DB, "DACCONTROL20"),
                        TAG,
                        "set right DAC mixer");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL21, ES8388_DAC_LRCK_SHARED, "DACCONTROL21"),
                        TAG,
                        "set DAC LRCK");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_DACCONTROL23, 0x00, "DACCONTROL23"), TAG, "ES8388 VROI");

    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_ADCPOWER,
                                                  ES8388_ADCPOWER_POWER_DOWN,
                                                  "ADCPOWER"),
                        TAG,
                        "power down ES8388 ADC during init");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_ADCCONTROL3, 0x02, "ADCCONTROL3"),
                        TAG,
                        "set ES8388 ADC mono/stereo");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_ADCCONTROL4, 0x0c | fmt, "ADCCONTROL4"),
                        TAG,
                        "set ES8388 ADC format");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_ADCCONTROL5, 0x02, "ADCCONTROL5"),
                        TAG,
                        "set ES8388 ADC ratio");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_ADCCONTROL8, 0x00, "ADCCONTROL8 left ADC volume"),
                        TAG,
                        "set left ADC volume");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_ADCCONTROL9, 0x00, "ADCCONTROL9 right ADC volume"),
                        TAG,
                        "set right ADC volume");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_ADCCONTROL10, 0xe2, "ADCCONTROL10"),
                        TAG,
                        "ES8388 ADC ALC");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_ADCCONTROL11, 0xa0, "ADCCONTROL11"),
                        TAG,
                        "ES8388 ADC ALC");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_ADCCONTROL12, 0x12, "ADCCONTROL12"),
                        TAG,
                        "ES8388 ADC ALC");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_ADCCONTROL13, 0x06, "ADCCONTROL13"),
                        TAG,
                        "ES8388 ADC ALC");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_ADCCONTROL14, 0xc3, "ADCCONTROL14"),
                        TAG,
                        "ES8388 ADC noise gate");

    esp32_audio_config_t audio = audio_config_snapshot();
    ESP_RETURN_ON_ERROR(audio_hw_apply_output_route(ESP32_OUTPUT_ROUTE_BOTH, false),
                        TAG,
                        "enable ES8388 outputs");
    ESP_RETURN_ON_ERROR(audio_hw_apply_audio_config(&audio), TAG, "apply ES8388 config");
    ESP_RETURN_ON_ERROR(audio_hw_write_es8388_reg(ES8388_ADCPOWER,
                                                  ES8388_ADCPOWER_ENABLE_ADC,
                                                  "ADCPOWER"),
                        TAG,
                        "enable ES8388 ADC");
    ESP_RETURN_ON_ERROR(audio_hw_set_pa_gpio_level(s_i2s_options.pa_active_high), TAG, "enable board output gate");

    s_audio_hw_ready = true;
    ESP_LOGI(TAG,
             "ES8388 opened through legacy I2S/register path at %u Hz, %u-bit, stereo, %s I2S",
             ESP32_AUDIO_HW_SAMPLE_RATE,
             ESP32_AUDIO_HW_BITS_PER_SAMPLE,
             i2s_format_name());
    es8388_dump_registers("after legacy init", &audio, false);
    return ESP_OK;
}

static esp_err_t audio_hw_write(const int16_t *stereo_frame, size_t bytes)
{
    if (!s_audio_hw_ready || !stereo_frame) {
        return ESP_ERR_INVALID_STATE;
    }
    int64_t start_us = esp_timer_get_time();
    int64_t previous_start_us = s_audio_hw_last_write_start_us;
    s_audio_hw_last_write_start_us = start_us;
    size_t bytes_written = 0;
    esp_err_t err = i2s_write(I2S_NUM_0, stereo_frame, bytes, &bytes_written, portMAX_DELAY);
    int64_t elapsed_us = esp_timer_get_time() - start_us;
    int64_t gap_us = previous_start_us > 0 ? start_us - previous_start_us : 0;
    bool gap_warning = gap_us > PLAYBACK_I2S_GAP_WARN_US;
    bool slow_warning = elapsed_us > PLAYBACK_I2S_SLOW_WRITE_WARN_US;
    bool short_warning = err != ESP_OK || bytes_written != bytes;
    if (gap_warning) {
        s_audio_hw_write_gap_warnings++;
    }
    if (slow_warning) {
        s_audio_hw_write_slow_warnings++;
    }
    if (short_warning) {
        s_audio_hw_write_short_warnings++;
    }
    if ((gap_warning || slow_warning || short_warning) &&
        start_us - s_audio_hw_last_write_warn_us >= PLAYBACK_I2S_WARN_THROTTLE_US) {
        ESP_LOGW(TAG,
                 "I2S playback timing warning: gap=%" PRId64 "us write=%" PRId64
                 "us bytes=%u/%u err=%s counts gap=%" PRIu32 " slow=%" PRIu32 " short=%" PRIu32,
                 gap_us,
                 elapsed_us,
                 (unsigned)bytes_written,
                 (unsigned)bytes,
                 esp_err_to_name(err),
                 s_audio_hw_write_gap_warnings,
                 s_audio_hw_write_slow_warnings,
                 s_audio_hw_write_short_warnings);
        s_audio_hw_last_write_warn_us = start_us;
    }
    if (err != ESP_OK) {
        return err;
    }
    return bytes_written == bytes ? ESP_OK : ESP_FAIL;
}

