gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
static esp_err_t audio_hw_read(int16_t *stereo_frame, size_t bytes)
{
    if (!s_audio_hw_ready || !stereo_frame) {
        return ESP_ERR_INVALID_STATE;
    }
    size_t bytes_read = 0;
    esp_err_t err = i2s_read(I2S_NUM_0, stereo_frame, bytes, &bytes_read, portMAX_DELAY);
    if (err != ESP_OK) {
        return err;
    }
    return bytes_read == bytes ? ESP_OK : ESP_FAIL;
}

static esp_err_t es8388_set_playback_mute(bool mute)
{
    if (!s_i2c_codec_dev) {
        return ESP_ERR_INVALID_STATE;
    }
    return audio_hw_update_es8388_reg_bits(ES8388_DACCONTROL3,
                                           ES8388_DACCONTROL3_DAC_MUTE,
                                           mute ? ES8388_DACCONTROL3_DAC_MUTE : 0,
                                           "DACCONTROL3 mute");
}


static void es8388_dump_registers(const char *reason, const esp32_audio_config_t *config, bool warn_on_mismatch)
{
    (void)config;
    (void)warn_on_mismatch;
    if (!s_i2c_codec_dev) {
        ESP_LOGW(TAG, "ES8388 register dump skipped before codec init: %s", reason ? reason : "unknown");
        return;
    }
    ESP_LOGI(TAG, "ES8388 register dump: %s", reason ? reason : "unknown");
    const uint8_t regs[] = {
        ES8388_CONTROL1,      ES8388_CONTROL2,      ES8388_CHIPPOWER,     ES8388_ADCPOWER,
        ES8388_DACPOWER,     ES8388_MASTERMODE,    ES8388_ADCCONTROL1,   ES8388_ADCCONTROL2,
        ES8388_ADCCONTROL3,  ES8388_ADCCONTROL4,   ES8388_ADCCONTROL5,   ES8388_ADCCONTROL8,
        ES8388_ADCCONTROL9,  ES8388_ADCCONTROL10,  ES8388_ADCCONTROL11,  ES8388_ADCCONTROL12,
        ES8388_ADCCONTROL13, ES8388_ADCCONTROL14,  ES8388_DACCONTROL1,   ES8388_DACCONTROL2,
        ES8388_DACCONTROL3,  ES8388_DACCONTROL4,   ES8388_DACCONTROL5,   ES8388_DACCONTROL16,
        ES8388_DACCONTROL17, ES8388_DACCONTROL18,  ES8388_DACCONTROL19,  ES8388_DACCONTROL20,
        ES8388_DACCONTROL21, ES8388_DACCONTROL23,  ES8388_DACCONTROL24,  ES8388_DACCONTROL25,
        ES8388_DACCONTROL26, ES8388_DACCONTROL27,
    };
    for (size_t i = 0; i < sizeof(regs) / sizeof(regs[0]); i++) {
        audio_hw_log_es8388_reg(regs[i], "ES8388");
    }
}

static esp_err_t es8388_apply_audio_config(const esp32_audio_config_t *config)
{
    return audio_hw_apply_audio_config(config);
}

static void request_audio_config_apply(const esp32_audio_config_t *config)
{
    if (!config || !s_audio_config_queue) {
        return;
    }
    if (xQueueOverwrite(s_audio_config_queue, config) != pdTRUE) {
        ESP_LOGW(TAG, "failed to queue audio config apply");
    }
}

static esp_err_t audio_i2s_set_codec(ic_codec_t codec)
{
    ESP_LOGI(TAG,
             "network codec=%s selected; ES8388 hardware remains fixed at %u Hz stereo",
             codec_wire(codec),
             ESP32_AUDIO_HW_SAMPLE_RATE);
    ic_pcm_frame_ring_clear(&s_playback_ring);
    ic_pcm_frame_ring_clear(&s_sidetone_ring);
    return ESP_OK;
}

static esp_err_t audio_i2s_init_with_options(const i2s_runtime_options_t *options)
{
    s_i2s_options = options ? *options : default_i2s_options();
    i2s_config_t i2s_config = {
        .mode = I2S_MODE_MASTER | I2S_MODE_TX | I2S_MODE_RX,
        .sample_rate = ESP32_AUDIO_HW_SAMPLE_RATE,
        .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
        .channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT,
        .communication_format = i2s_legacy_comm_format_for(&s_i2s_options),
        .intr_alloc_flags = 0,
        .dma_desc_num = 8,
        .dma_frame_num = ESP32_AUDIO_HW_SAMPLES_PER_FRAME,
        .use_apll = false,
        .tx_desc_auto_clear = false,
        .fixed_mclk = s_i2s_options.mclk_enabled ? (int)(ESP32_AUDIO_HW_SAMPLE_RATE * 256U) : 0,
        .mclk_multiple = I2S_MCLK_MULTIPLE_256,
        .bits_per_chan = audio_i2s_bits_per_chan_for(&s_i2s_options),
    };
    i2s_pin_config_t pin_config = {
        .mck_io_num = s_i2s_options.mclk_enabled ? CONFIG_INTERCOM_I2S_MCLK_GPIO : I2S_PIN_NO_CHANGE,
        .bck_io_num = CONFIG_INTERCOM_I2S_BCLK_GPIO,
        .ws_io_num = (int)audio_i2s_ws_gpio_for(&s_i2s_options),
        .data_out_num = (int)audio_i2s_dout_gpio_for(&s_i2s_options),
        .data_in_num = CONFIG_INTERCOM_I2S_DIN_GPIO,
    };

    ESP_LOGI(TAG,
             "initializing legacy I2S hardware sample_rate=%u"
             " Hz format=%s data_width=%s slot_width=%s mclk=%s pa=%s pins=%s bclk=%d ws=%d dout=%d din=%d mclk_gpio=%d",
             ESP32_AUDIO_HW_SAMPLE_RATE,
             i2s_format_name(),
             i2s_data_width_name(),
             i2s_slot_width_name(),
             s_i2s_options.mclk_enabled ? "on" : "off",
             s_i2s_options.pa_active_high ? "active-high" : "active-low",
             i2s_pin_profile_name(),
             CONFIG_INTERCOM_I2S_BCLK_GPIO,
             (int)audio_i2s_ws_gpio_for(&s_i2s_options),
             (int)audio_i2s_dout_gpio_for(&s_i2s_options),
             CONFIG_INTERCOM_I2S_DIN_GPIO,
             s_i2s_options.mclk_enabled ? CONFIG_INTERCOM_I2S_MCLK_GPIO : -1);
    ESP_ERROR_CHECK_WITHOUT_ABORT(i2s_driver_uninstall(I2S_NUM_0));
    ESP_RETURN_ON_ERROR(i2s_driver_install(I2S_NUM_0, &i2s_config, 0, NULL), TAG, "legacy i2s install");
    ESP_RETURN_ON_ERROR(i2s_set_pin(I2S_NUM_0, &pin_config), TAG, "legacy i2s set pins");
    ESP_RETURN_ON_ERROR(i2s_set_clk(I2S_NUM_0,
                                    ESP32_AUDIO_HW_SAMPLE_RATE,
                                    I2S_BITS_PER_SAMPLE_16BIT,
                                    I2S_CHANNEL_STEREO),
                        TAG,
                        "legacy i2s set clock");
    ESP_RETURN_ON_ERROR(i2s_zero_dma_buffer(I2S_NUM_0), TAG, "legacy i2s clear dma");
    audio_i2s_log_channel_info("tx/rx");
    return ESP_OK;
}

static esp_err_t audio_i2s_init(void)
{
    i2s_runtime_options_t options = default_i2s_options();
    return audio_i2s_init_with_options(&options);
}

static void buttons_init(void)
{
    uint64_t pullup_mask = 0;
    uint64_t floating_mask = 0;
    int ptt_gpio = CONFIG_INTERCOM_PTT_GPIO;
    if (ptt_gpio >= 0) {
        if (gpio_supports_internal_pullup(ptt_gpio)) {
            pullup_mask |= 1ULL << (unsigned)ptt_gpio;
        } else {
            floating_mask |= 1ULL << (unsigned)ptt_gpio;
        }
    }
    for (size_t i = 0; i < sizeof(s_dedicated_buttons) / sizeof(s_dedicated_buttons[0]); i++) {
        if (physical_button_enabled(&s_dedicated_buttons[i])) {
            int button_gpio = s_dedicated_buttons[i].gpio;
            if (gpio_supports_internal_pullup(button_gpio)) {
                pullup_mask |= 1ULL << (unsigned)button_gpio;
            } else {
                floating_mask |= 1ULL << (unsigned)button_gpio;
            }
        }
    }
    if (!pullup_mask && !floating_mask) {
        return;
    }
    if (pullup_mask) {
        gpio_config_t cfg = {
            .pin_bit_mask = pullup_mask,
            .mode = GPIO_MODE_INPUT,
            .pull_up_en = GPIO_PULLUP_ENABLE,
            .pull_down_en = GPIO_PULLDOWN_DISABLE,
            .intr_type = GPIO_INTR_DISABLE,
        };
        ESP_ERROR_CHECK(gpio_config(&cfg));
    }
    if (floating_mask) {
        ESP_LOGW(TAG, "button GPIO mask 0x%" PRIx64 " has no internal pull-up; use an external pull-up", floating_mask);
        gpio_config_t cfg = {
            .pin_bit_mask = floating_mask,
            .mode = GPIO_MODE_INPUT,
            .pull_up_en = GPIO_PULLUP_DISABLE,
            .pull_down_en = GPIO_PULLDOWN_DISABLE,
            .intr_type = GPIO_INTR_DISABLE,
        };
        ESP_ERROR_CHECK(gpio_config(&cfg));
    }
}

static void target_add(tx_target_t *targets, size_t *count, size_t max, ic_target_kind_t kind, uint16_t id)
{
    if (id == 0) {
        return;
    }
    for (size_t i = 0; i < *count; i++) {
        if (targets[i].kind == kind && targets[i].id == id) {
            return;
        }
    }
    if (*count < max) {
        targets[*count] = (tx_target_t){.kind = kind, .id = id};
        (*count)++;
    }
}

static size_t build_tx_targets(tx_target_t *targets, size_t max)
{
    size_t count = 0;
    xSemaphoreTake(s_config_lock, portMAX_DELAY);
    bool regular = s_config.talk_mode == TALK_MODE_OPEN ||
                   (s_config.talk_mode == TALK_MODE_PTT && s_config.regular_talk_active);
    if (regular) {
        for (size_t i = 0; i < s_config.tx.count; i++) {
            target_add(targets, &count, max, IC_TARGET_CHANNEL, s_config.tx.values[i]);
        }
    }
    for (size_t i = 0; i < s_config.button_count; i++) {
        const button_route_t *button = &s_config.buttons[i];
        if (!button->active) {
            continue;
        }
        for (size_t j = 0; j < button->tx_channels.count; j++) {
            target_add(targets, &count, max, IC_TARGET_CHANNEL, button->tx_channels.values[j]);
        }
        for (size_t j = 0; j < button->tx_users.count; j++) {
            target_add(targets, &count, max, IC_TARGET_DIRECT, button->tx_users.values[j]);
        }
    }
    xSemaphoreGive(s_config_lock);
    return count;
}

static bool enqueue_audio_payload(ic_target_kind_t kind,
                                  uint16_t target_id,
                                  ic_codec_t codec,
                                  const uint8_t *payload,
                                  uint16_t payload_len)
{
    if (!s_audio_tx_queue || s_audio_sock < 0) {
        return false;
    }
    audio_tx_packet_t *tx = &s_audio_tx_encode_packet;
    size_t written = 0;
    ic_audio_packet_t packet = {
        .user_id = current_user_id(),
        .target_kind = kind,
        .target_id = target_id,
        .codec = codec,
        .seq = s_audio_seq++,
        .timestamp_ms = (uint32_t)(esp_timer_get_time() / 1000),
        .payload = payload,
        .payload_len = payload_len,
    };
    if (!ic_encode_audio_packet(&packet, tx->bytes, sizeof(tx->bytes), &written)) {
        return false;
    }
    tx->len = (uint16_t)written;
    return xQueueSend(s_audio_tx_queue, tx, 0) == pdTRUE;
}

static void drain_audio_tx_queue(int sock)
{
    if (!s_audio_tx_queue || sock < 0) {
        return;
    }
    while (xQueueReceive(s_audio_tx_queue, &s_audio_tx_send_packet, 0) == pdTRUE) {
        if (send(sock,
                 s_audio_tx_send_packet.bytes,
                 s_audio_tx_send_packet.len,
                 0) != (int)s_audio_tx_send_packet.len) {
            ESP_LOGW(TAG, "UDP audio send failed: errno=%d", errno);
        }
    }
}

static void send_registration(void)
{
    int sock = s_audio_sock;
    if (sock < 0) {
        return;
    }
    uint8_t encoded[IC_HEADER_LEN];
    size_t written = 0;
    ic_codec_t codec = runtime_codec_snapshot();
    ic_audio_packet_t packet = {
        .user_id = current_user_id(),
        .target_kind = IC_TARGET_MIXED,
        .target_id = 0,
        .codec = codec,
        .seq = s_registration_seq++,
        .timestamp_ms = 0,
        .payload = NULL,
        .payload_len = 0,
    };
    if (ic_encode_audio_packet(&packet, encoded, sizeof(encoded), &written)) {
        (void)send(sock, encoded, written, 0);
    }
}

