gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
static void udp_task(void *arg)
{
    (void)arg;
    ESP_LOGI(TAG, "task ic_udp running on core %d", xPortGetCoreID());
    struct sockaddr_storage server_addr;
    socklen_t server_len = 0;

    for (;;) {
        xEventGroupWaitBits(s_wifi_events, WIFI_CONNECTED_BIT, false, true, portMAX_DELAY);
        if (resolve_server(&server_addr, &server_len, CONFIG_INTERCOM_AUDIO_PORT) != ESP_OK) {
            ESP_LOGW(TAG, "failed to resolve audio server %s", CONFIG_INTERCOM_SERVER_HOST);
            vTaskDelay(pdMS_TO_TICKS(1000));
            continue;
        }

        int sock = socket(server_addr.ss_family, SOCK_DGRAM, IPPROTO_IP);
        if (sock < 0) {
            ESP_LOGW(TAG, "socket failed: errno=%d", errno);
            vTaskDelay(pdMS_TO_TICKS(1000));
            continue;
        }
        if (connect(sock, (struct sockaddr *)&server_addr, server_len) != 0) {
            ESP_LOGW(TAG, "UDP connect failed: errno=%d", errno);
            close(sock);
            vTaskDelay(pdMS_TO_TICKS(1000));
            continue;
        }
        struct timeval timeout = {
            .tv_sec = 0,
            .tv_usec = IC_FRAME_MS * 1000,
        };
        (void)setsockopt(sock, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof(timeout));
        (void)setsockopt(sock, SOL_SOCKET, SO_SNDTIMEO, &timeout, sizeof(timeout));

        s_audio_sock = sock;
        ESP_LOGI(TAG, "UDP audio connected to %s:%d", CONFIG_INTERCOM_SERVER_HOST, CONFIG_INTERCOM_AUDIO_PORT);
        send_registration();

        for (;;) {
            drain_audio_tx_queue(sock);
            int len = recv(sock, s_udp_rx_packet, sizeof(s_udp_rx_packet), 0);
            if (len <= 0) {
                if (errno == EAGAIN || errno == EWOULDBLOCK) {
                    continue;
                }
                ESP_LOGW(TAG, "UDP receive failed: errno=%d", errno);
                break;
            }
            ic_audio_packet_t packet;
            if (!ic_decode_audio_packet(s_udp_rx_packet, len, &packet)) {
                continue;
            }
            ic_codec_t codec = runtime_codec_snapshot();
            size_t packet_samples_per_frame = codec_samples_per_frame(codec);
            size_t mono_payload_len = codec_payload_bytes(codec);
            bool stereo_payload = packet.codec == codec && packet.payload_len == mono_payload_len * 2;
            if (packet.target_kind != IC_TARGET_MIXED || packet.codec != codec ||
                (packet.payload_len != mono_payload_len && !stereo_payload)) {
                continue;
            }
            memset(s_udp_packet_frame, 0, sizeof(s_udp_packet_frame));
            for (size_t i = 0; i < packet_samples_per_frame; i++) {
                if (stereo_payload) {
                    int16_t left = read_le_i16(&packet.payload[i * 4]);
                    int16_t right = read_le_i16(&packet.payload[i * 4 + 2]);
                    s_udp_packet_frame[i] = (int16_t)(((int)left + (int)right) / 2);
                } else {
                    s_udp_packet_frame[i] = read_le_i16(&packet.payload[i * 2]);
                }
            }
            resample_network_to_hw(s_udp_packet_frame, packet_samples_per_frame, s_udp_playback_frame);
            ic_pcm_frame_ring_push(&s_playback_ring, s_udp_playback_frame);
        }

        s_audio_sock = -1;
        close(sock);
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

static void registration_task(void *arg)
{
    (void)arg;
    ESP_LOGI(TAG, "task ic_register running on core %d", xPortGetCoreID());
    int64_t last_reconnect_cue_us = 0;
    int64_t last_ping_us = 0;
    int64_t last_capture_health_us = 0;
    for (;;) {
        send_registration();
        int64_t now_us = esp_timer_get_time();
        if (control_connected_snapshot()) {
            if (control_take_hello_pending()) {
                send_hello();
                last_ping_us = now_us;
                last_capture_health_us = now_us;
            }
            if (control_take_startup_config_pending()) {
                send_startup_config();
            }
            if (websocket_ready() && (last_ping_us == 0 || now_us - last_ping_us >= CONTROL_PING_INTERVAL_US)) {
                send_ping();
                last_ping_us = now_us;
            }
            if (websocket_ready() &&
                (last_capture_health_us == 0 ||
                 now_us - last_capture_health_us >= CONTROL_CAPTURE_HEALTH_SEND_INTERVAL_US)) {
                send_capture_health();
                last_capture_health_us = now_us;
            }
            last_reconnect_cue_us = 0;
        } else {
            last_ping_us = 0;
            last_capture_health_us = 0;
            if (last_reconnect_cue_us == 0) {
                last_reconnect_cue_us = now_us;
            } else if (now_us - last_reconnect_cue_us >= AUDIO_CUE_RECONNECT_INTERVAL_US) {
                audio_cue_start(AUDIO_CUE_RECONNECTING);
                last_reconnect_cue_us = now_us;
            }
        }
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

static void codec_mute_task(void *arg)
{
    (void)arg;
    ESP_LOGI(TAG, "task ic_codec_mute running on core %d", xPortGetCoreID());
    bool mute = true;
    for (;;) {
        if (xQueueReceive(s_codec_mute_queue, &mute, portMAX_DELAY) != pdTRUE) {
            continue;
        }
        esp_err_t err = es8388_set_playback_mute(mute);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "failed to %s ES8388 playback output", mute ? "mute" : "unmute");
        }
    }
}

static void audio_config_apply_task(void *arg)
{
    (void)arg;
    ESP_LOGI(TAG, "task ic_audio_cfg running on core %d", xPortGetCoreID());
    esp32_audio_config_t audio;
    for (;;) {
        if (xQueueReceive(s_audio_config_queue, &audio, portMAX_DELAY) != pdTRUE) {
            continue;
        }
        esp_err_t err = es8388_apply_audio_config(&audio);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "failed to apply ESP32 audio config: %s", esp_err_to_name(err));
            continue;
        }
        es8388_dump_registers("after server esp32_audio config", &audio, true);
        ESP_LOGI(TAG,
                 "audio config: server=%s input=%s pga=%u dB channel=%s hp=%s mic=%u%% speaker=%u%% notifications=%u%% alc=%s noise_gate=%s sidetone=%s firmware_gain=%u%% line_bypass=%u%% mic_bypass=%u%%",
                 audio.server_control_enabled ? "on" : "off",
                 adc_input_name(audio.adc_input),
                 audio.mic_pga_gain_db,
                 capture_channel_name(audio.capture_channel),
                 audio.high_pass_enabled ? "on" : "off",
                 audio.mic_software_gain_percent,
                 audio.speaker_software_gain_percent,
                 audio.notification_gain_percent,
                 audio.alc_enabled ? "on" : "off",
                 audio.noise_gate_enabled ? "on" : "off",
                 sidetone_mode_name(audio.sidetone_mode),
                 audio.sidetone_firmware_gain_percent,
                 audio.sidetone_codec_bypass_gain_percent,
                 audio.sidetone_mic_bypass_gain_percent);
    }
}

static void playback_task(void *arg)
{
    (void)arg;
    ESP_LOGI(TAG, "task ic_playback running on core %d", xPortGetCoreID());
    bool playback_started = false;
    int16_t last_playback_sample = 0;
    playback_codec_mute_gate_t mute_gate = {0};

