gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
    for (;;) {
        esp32_audio_config_t audio = audio_config_snapshot();
        size_t samples_per_frame = ESP32_AUDIO_HW_SAMPLES_PER_FRAME;
        size_t prefill_frames = CONFIG_INTERCOM_PLAYBACK_PREFILL_FRAMES;
        if (prefill_frames > CONFIG_INTERCOM_JITTER_FRAMES) {
            prefill_frames = CONFIG_INTERCOM_JITTER_FRAMES;
        }
        bool have_playback_frame = false;
        if (!playback_started) {
            if (ic_pcm_frame_ring_count(&s_playback_ring) >= prefill_frames) {
                have_playback_frame = ic_pcm_frame_ring_pop(&s_playback_ring, s_playback_mono_frame);
                if (have_playback_frame) {
                    apply_playback_fade_in(s_playback_mono_frame, samples_per_frame);
                    playback_started = true;
                }
            }
        } else {
            have_playback_frame = ic_pcm_frame_ring_pop(&s_playback_ring, s_playback_mono_frame);
            if (!have_playback_frame) {
                playback_started = false;
            }
        }
        if (!have_playback_frame) {
            fill_playback_fade_to_silence(s_playback_mono_frame, samples_per_frame, last_playback_sample);
        }
        if (!ic_pcm_frame_ring_pop(&s_sidetone_ring, s_playback_sidetone_frame)) {
            memset(s_playback_sidetone_frame, 0, sizeof(s_playback_sidetone_frame));
        }
        bool frame_active = false;
        for (size_t i = 0; i < samples_per_frame; i++) {
            int mixed = (int)s_playback_mono_frame[i];
            if (audio.sidetone_mode == ESP32_SIDETONE_FIRMWARE) {
                mixed += (int)s_playback_sidetone_frame[i] * audio.sidetone_firmware_gain_percent / 100;
            }
            mixed += audio_cue_next_sample();
            mixed = mixed * audio.speaker_software_gain_percent / 100;
            int abs_mixed = mixed < 0 ? -mixed : mixed;
            if (abs_mixed > PLAYBACK_CODEC_ACTIVE_THRESHOLD) {
                frame_active = true;
            }
            int16_t sample = clamp_i16(mixed);
            if (sample == 0) {
                sample = playback_idle_floor_sample();
            }
            s_playback_stereo_frame[i * 2] = sample;
            s_playback_stereo_frame[i * 2 + 1] = sample;
        }
        last_playback_sample = s_playback_mono_frame[samples_per_frame - 1];
        size_t bytes_written = 0;
        size_t frame_bytes = samples_per_frame * 2 * sizeof(int16_t);
        esp_err_t err = audio_hw_write(s_playback_stereo_frame, frame_bytes);
        bytes_written = err == ESP_OK ? frame_bytes : 0;
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "codec playback short write: err=%s bytes=%u/%u",
                     esp_err_to_name(err),
                     (unsigned)bytes_written,
                     (unsigned)frame_bytes);
        }
        if (!PLAYBACK_CODEC_MUTE_GATE_ENABLED || audio.sidetone_mode == ESP32_SIDETONE_CODEC_BYPASS) {
            request_codec_output_mute(false);
        } else {
            playback_codec_mute_gate_update(&mute_gate, frame_active);
        }
    }
}

static void capture_channel_accumulate(capture_channel_accumulator_t *channel, int sample)
{
    int abs_sample = sample < 0 ? -sample : sample;
    if (abs_sample > channel->peak_abs) {
        channel->peak_abs = abs_sample;
    }
    channel->sum += (double)sample;
    channel->sum_squares += (double)sample * (double)sample;
}

static float capture_channel_rms(const capture_channel_accumulator_t *channel, uint32_t samples)
{
    if (samples == 0) {
        return 0.0f;
    }
    return (float)(sqrt(channel->sum_squares / (double)samples) / 32768.0);
}

static float capture_channel_peak(const capture_channel_accumulator_t *channel)
{
    return (float)channel->peak_abs / 32768.0f;
}

static float capture_channel_dc_offset(const capture_channel_accumulator_t *channel, uint32_t samples)
{
    if (samples == 0) {
        return 0.0f;
    }
    return (float)((channel->sum / (double)samples) / 32768.0);
}

static void capture_health_maybe_publish(capture_health_accumulator_t *acc, int64_t now_us)
{
    if (acc->started_us == 0) {
        acc->started_us = now_us;
    }
    if (now_us - acc->started_us < CAPTURE_HEALTH_REPORT_US || acc->samples == 0) {
        return;
    }

    capture_health_report_t report = {
        .left_rms = capture_channel_rms(&acc->left, acc->samples),
        .left_peak = capture_channel_peak(&acc->left),
        .left_dc_offset = capture_channel_dc_offset(&acc->left, acc->samples),
        .right_rms = capture_channel_rms(&acc->right, acc->samples),
        .right_peak = capture_channel_peak(&acc->right),
        .right_dc_offset = capture_channel_dc_offset(&acc->right, acc->samples),
        .selected_rms = capture_channel_rms(&acc->selected, acc->samples),
        .selected_peak = capture_channel_peak(&acc->selected),
        .selected_dc_offset = capture_channel_dc_offset(&acc->selected, acc->samples),
        .raw_clipped_samples = acc->raw_clipped_samples,
        .software_clipped_samples = acc->software_clipped_samples,
        .tx_target_count = acc->tx_target_count,
        .tx_packets_sent = acc->tx_packets_sent,
        .tx_send_failures = acc->tx_send_failures,
        .ready = true,
    };

    taskENTER_CRITICAL(&s_capture_health_lock);
    s_capture_health_report = report;
    taskEXIT_CRITICAL(&s_capture_health_lock);

    memset(acc, 0, sizeof(*acc));
    acc->started_us = now_us;
}

static void diagnostic_play_tone(uint32_t sample_rate, float frequency, float amplitude, uint32_t duration_ms)
{
    uint32_t total_samples = sample_rate * duration_ms / 1000U;
    uint32_t ramp_samples = samples_for_ms_u32(sample_rate, 20);
    uint32_t sample_index = 0;
    uint32_t writes = 0;
    uint32_t bytes_total = 0;
    int peak = 0;
    while (sample_index < total_samples) {
        size_t frame_samples = ESP32_AUDIO_HW_SAMPLES_PER_FRAME;
        uint32_t remaining = total_samples - sample_index;
        if (remaining < frame_samples) {
            frame_samples = remaining;
        }
        for (size_t i = 0; i < frame_samples; i++) {
            uint32_t absolute = sample_index + (uint32_t)i;
            float envelope = 1.0f;
            if (absolute < ramp_samples) {
                envelope = smoothstep_unit((float)absolute / (float)ramp_samples);
            } else if (total_samples > absolute && total_samples - absolute < ramp_samples) {
                envelope = smoothstep_unit((float)(total_samples - absolute) / (float)ramp_samples);
            }
            float phase = 2.0f * AUDIO_CUE_PI * frequency * (float)absolute / (float)sample_rate;
            int16_t sample = clamp_i16((int)lrintf(sinf(phase) * amplitude * envelope));
            int abs_sample = abs_i16_value(sample);
            if (abs_sample > peak) {
                peak = abs_sample;
            }
            s_playback_stereo_frame[i * 2] = sample;
            s_playback_stereo_frame[i * 2 + 1] = sample;
        }
        size_t bytes_written = 0;
        size_t frame_bytes = frame_samples * 2 * sizeof(int16_t);
        esp_err_t err = audio_hw_write(s_playback_stereo_frame, frame_bytes);
        bytes_written = err == ESP_OK ? frame_bytes : 0;
        if (err != ESP_OK) {
            ESP_LOGW(TAG,
                     "diagnostic tone write failed: err=%s bytes=%u/%u",
                     esp_err_to_name(err),
                     (unsigned)bytes_written,
                     (unsigned)frame_bytes);
            break;
        }
        sample_index += (uint32_t)frame_samples;
        writes++;
        bytes_total += (uint32_t)bytes_written;
    }
    ESP_LOGI(TAG,
             "diagnostic tone wrote freq=%.1fHz duration=%ums samples=%" PRIu32 "/%" PRIu32
             " writes=%" PRIu32 " bytes=%" PRIu32 " peak=%.3f",
             (double)frequency,
             (unsigned)duration_ms,
             sample_index,
             total_samples,
             writes,
             bytes_total,
             (double)peak / 32768.0);
}

static void diagnostic_output_test(void)
{
    uint32_t pass = 0;
    const struct {
        const char *label;
        uint8_t dac_power;
        uint8_t out1_volume;
        uint8_t out2_volume;
        bool pa_high;
    } profiles[] = {
        {"Community Aux/headphone: DACPOWER 0x0c, OUT2 max, PA high",
         0x0c,
         ES8388_OUTPUT_VOLUME_MUTE,
         ES8388_OUTPUT_VOLUME_PLUS_4_5DB,
         true},
        {"Community Aux/headphone: DACPOWER 0x0c, OUT2 max, PA low",
         0x0c,
         ES8388_OUTPUT_VOLUME_MUTE,
         ES8388_OUTPUT_VOLUME_PLUS_4_5DB,
         false},
        {"Community speaker/line1: DACPOWER 0x30, OUT1 max, PA high",
         0x30,
         ES8388_OUTPUT_VOLUME_PLUS_4_5DB,
         ES8388_OUTPUT_VOLUME_MUTE,
         true},
        {"Community speaker/line1: DACPOWER 0x30, OUT1 max, PA low",
         0x30,
         ES8388_OUTPUT_VOLUME_PLUS_4_5DB,
         ES8388_OUTPUT_VOLUME_MUTE,
         false},
        {"ADF all outputs: DACPOWER 0x3c, OUT1+OUT2 max, PA high",
         ES8388_DACPOWER_ENABLE_ALL_OUTPUTS,
         ES8388_OUTPUT_VOLUME_PLUS_4_5DB,
         ES8388_OUTPUT_VOLUME_PLUS_4_5DB,
         true},
        {"ADF all outputs: DACPOWER 0x3c, OUT1+OUT2 max, PA low",
         ES8388_DACPOWER_ENABLE_ALL_OUTPUTS,
         ES8388_OUTPUT_VOLUME_PLUS_4_5DB,
         ES8388_OUTPUT_VOLUME_PLUS_4_5DB,
         false},
    };
    ESP_LOGW(TAG,
             "audio diagnostic output-test started through legacy I2S/ES8388; Wi-Fi/control/UDP/capture/PTT are disabled");
    for (;;) {
        for (size_t i = 0; i < sizeof(profiles) / sizeof(profiles[0]); i++) {
            ESP_ERROR_CHECK_WITHOUT_ABORT(es8388_set_playback_mute(true));
            ESP_ERROR_CHECK_WITHOUT_ABORT(audio_hw_apply_output_registers(profiles[i].label,
                                                                          profiles[i].dac_power,
                                                                          profiles[i].out1_volume,
                                                                          profiles[i].out2_volume,
                                                                          true));
            ESP_ERROR_CHECK_WITHOUT_ABORT(audio_hw_set_pa_gpio_level(profiles[i].pa_high));
            vTaskDelay(pdMS_TO_TICKS(180));
            ESP_ERROR_CHECK_WITHOUT_ABORT(es8388_set_playback_mute(false));
            vTaskDelay(pdMS_TO_TICKS(20));
            ESP_LOGW(TAG,
                     "output-test pass=%" PRIu32 " profile=%s fixed=48000Hz/16-bit/stereo/%s/MCLK: "
                     "listen for three clean tones",
                     pass++,
                     profiles[i].label,
                     i2s_format_name());
            diagnostic_play_tone(ESP32_AUDIO_HW_SAMPLE_RATE, 440.0f, 12000.0f, 220);
            vTaskDelay(pdMS_TO_TICKS(120));
            diagnostic_play_tone(ESP32_AUDIO_HW_SAMPLE_RATE, 660.0f, 12000.0f, 220);
            vTaskDelay(pdMS_TO_TICKS(120));
            diagnostic_play_tone(ESP32_AUDIO_HW_SAMPLE_RATE, 880.0f, 12000.0f, 300);
            vTaskDelay(pdMS_TO_TICKS(900));
        }
    }
}

