gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
static void diagnostic_log_capture_report(const char *prefix,
                                          esp32_adc_input_t input,
                                          const capture_health_accumulator_t *acc)
{
    if (!acc || acc->samples == 0) {
        return;
    }
    capture_channel_accumulator_t average = {0};
    average.peak_abs = (acc->left.peak_abs + acc->right.peak_abs) / 2;
    average.sum = (acc->left.sum + acc->right.sum) / 2.0;
    average.sum_squares = (acc->left.sum_squares + acc->right.sum_squares) / 2.0;
    ESP_LOGW(TAG,
             "%s input=%s samples=%" PRIu32
             " left:rms=%.4f peak=%.4f dc=%.4f right:rms=%.4f peak=%.4f dc=%.4f avg:rms=%.4f peak=%.4f dc=%.4f raw_clips=%" PRIu32,
             prefix,
             adc_input_name(input),
             acc->samples,
             capture_channel_rms(&acc->left, acc->samples),
             capture_channel_peak(&acc->left),
             capture_channel_dc_offset(&acc->left, acc->samples),
             capture_channel_rms(&acc->right, acc->samples),
             capture_channel_peak(&acc->right),
             capture_channel_dc_offset(&acc->right, acc->samples),
             capture_channel_rms(&average, acc->samples),
             capture_channel_peak(&average),
             capture_channel_dc_offset(&average, acc->samples),
             acc->raw_clipped_samples);
}

static void diagnostic_accumulate_capture_frame(capture_health_accumulator_t *acc, size_t samples_per_frame)
{
    for (size_t i = 0; i < samples_per_frame; i++) {
        int16_t left = s_capture_stereo_frame[i * 2];
        int16_t right = s_capture_stereo_frame[i * 2 + 1];
        if (abs_i16_value(left) >= CAPTURE_CLIP_THRESHOLD || abs_i16_value(right) >= CAPTURE_CLIP_THRESHOLD) {
            acc->raw_clipped_samples++;
        }
        capture_channel_accumulate(&acc->left, left);
        capture_channel_accumulate(&acc->right, right);
        acc->samples++;
    }
}

static void diagnostic_capture_test(void)
{
    ESP_LOGW(TAG,
             "audio diagnostic capture-test started through legacy I2S/ES8388; Wi-Fi/control/UDP/playback/PTT are disabled");
    esp32_audio_config_t initial_audio = audio_config_snapshot();
    ESP_ERROR_CHECK_WITHOUT_ABORT(audio_hw_apply_audio_config(&initial_audio));
    for (;;) {
        esp32_audio_config_t audio = audio_config_snapshot();
        int64_t report_start = esp_timer_get_time();
        capture_health_accumulator_t acc = {0};
        while (esp_timer_get_time() - report_start < 1000000) {
            esp_err_t err = audio_hw_read(s_capture_stereo_frame, ESP32_AUDIO_HW_FRAME_BYTES);
            if (err != ESP_OK) {
                ESP_LOGW(TAG, "capture-test read failed: %s", esp_err_to_name(err));
                continue;
            }
            diagnostic_accumulate_capture_frame(&acc, ESP32_AUDIO_HW_SAMPLES_PER_FRAME);
        }
        diagnostic_log_capture_report("capture-test", audio.adc_input, &acc);
    }
}

static void diagnostic_local_loopback(void)
{
    ESP_LOGW(TAG, "audio diagnostic local-loopback started; Wi-Fi/control/UDP/PTT are disabled");
    capture_health_accumulator_t acc = {0};
    int64_t report_start = esp_timer_get_time();
    for (;;) {
        esp32_audio_config_t audio = audio_config_snapshot();
        size_t samples_per_frame = ESP32_AUDIO_HW_SAMPLES_PER_FRAME;
        esp_err_t err = audio_hw_read(s_capture_stereo_frame, ESP32_AUDIO_HW_FRAME_BYTES);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "local-loopback capture read failed: %s", esp_err_to_name(err));
            continue;
        }

        diagnostic_accumulate_capture_frame(&acc, samples_per_frame);
        for (size_t i = 0; i < samples_per_frame; i++) {
            int16_t left = s_capture_stereo_frame[i * 2];
            int16_t right = s_capture_stereo_frame[i * 2 + 1];
            int selected = capture_select_sample(&audio, left, right);
            int filtered = capture_high_pass_sample(&audio, selected);
            int mixed = filtered * audio.mic_software_gain_percent / 100;
            int16_t sample = clamp_i16(mixed);
            s_playback_stereo_frame[i * 2] = sample;
            s_playback_stereo_frame[i * 2 + 1] = sample;
        }
        err = audio_hw_write(s_playback_stereo_frame, ESP32_AUDIO_HW_FRAME_BYTES);
        if (err != ESP_OK) {
            ESP_LOGW(TAG,
                     "local-loopback playback write failed: err=%s bytes=0/%u",
                     esp_err_to_name(err),
                     (unsigned)ESP32_AUDIO_HW_FRAME_BYTES);
        }
        int64_t now = esp_timer_get_time();
        if (now - report_start >= 1000000) {
            diagnostic_log_capture_report("local-loopback", audio.adc_input, &acc);
            memset(&acc, 0, sizeof(acc));
            report_start = now;
        }
    }
}

static void capture_task(void *arg)
{
    (void)arg;
    ESP_LOGI(TAG, "task ic_capture running on core %d", xPortGetCoreID());
    capture_health_accumulator_t capture_health = {0};

    for (;;) {
        ic_codec_t codec = runtime_codec_snapshot();
        size_t hw_samples_per_frame = ESP32_AUDIO_HW_SAMPLES_PER_FRAME;
        size_t packet_samples_per_frame = codec_samples_per_frame(codec);
        size_t payload_bytes = codec_payload_bytes(codec);
        esp_err_t err = audio_hw_read(s_capture_stereo_frame, ESP32_AUDIO_HW_FRAME_BYTES);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "codec capture read failed: %s", esp_err_to_name(err));
            continue;
        }

        esp32_audio_config_t audio = audio_config_snapshot();
        memset(s_capture_mono_frame, 0, sizeof(s_capture_mono_frame));
        for (size_t i = 0; i < hw_samples_per_frame; i++) {
            int16_t left = s_capture_stereo_frame[i * 2];
            int16_t right = s_capture_stereo_frame[i * 2 + 1];
            int selected = capture_select_sample(&audio, left, right);
            int filtered = capture_high_pass_sample(&audio, selected);
            int amplified = filtered * audio.mic_software_gain_percent / 100;
            if (abs_i16_value(left) >= CAPTURE_CLIP_THRESHOLD || abs_i16_value(right) >= CAPTURE_CLIP_THRESHOLD) {
                capture_health.raw_clipped_samples++;
            }
            if (amplified > INT16_MAX || amplified < INT16_MIN) {
                capture_health.software_clipped_samples++;
            }
            s_capture_mono_frame[i] = clamp_i16(amplified);
            capture_channel_accumulate(&capture_health.left, left);
            capture_channel_accumulate(&capture_health.right, right);
            capture_channel_accumulate(&capture_health.selected, s_capture_mono_frame[i]);
            capture_health.samples++;
        }
        resample_hw_to_network(s_capture_mono_frame, s_capture_packet_frame, packet_samples_per_frame);
        for (size_t i = 0; i < packet_samples_per_frame; i++) {
            s_capture_payload[i * 2] = (uint8_t)s_capture_packet_frame[i];
            s_capture_payload[i * 2 + 1] = (uint8_t)((uint16_t)s_capture_packet_frame[i] >> 8);
        }
        capture_health_maybe_publish(&capture_health, esp_timer_get_time());

