gilliangoud/OpenBroadcastIntercom/clients/esp32/main/main.c
        if (audio.sidetone_mode == ESP32_SIDETONE_FIRMWARE) {
            ic_pcm_frame_ring_push(&s_sidetone_ring, s_capture_mono_frame);
        }
        size_t count = build_tx_targets(s_capture_targets, sizeof(s_capture_targets) / sizeof(s_capture_targets[0]));
        capture_health.tx_target_count = (uint16_t)count;
        for (size_t i = 0; i < count; i++) {
            if (enqueue_audio_payload(s_capture_targets[i].kind,
                                      s_capture_targets[i].id,
                                      codec,
                                      s_capture_payload,
                                      (uint16_t)payload_bytes)) {
                capture_health.tx_packets_sent++;
            } else {
                capture_health.tx_send_failures++;
            }
        }
    }
}

static void set_local_regular_talk(bool active)
{
    xSemaphoreTake(s_config_lock, portMAX_DELAY);
    s_config.regular_talk_active = active;
    xSemaphoreGive(s_config_lock);
}

static void set_local_button_pressed(const char *id, bool pressed)
{
    xSemaphoreTake(s_config_lock, portMAX_DELAY);
    for (size_t i = 0; i < s_config.button_count; i++) {
        if (!string_eq(s_config.buttons[i].id, id)) {
            continue;
        }
        if (s_config.buttons[i].latching) {
            if (pressed) {
                s_config.buttons[i].active = !s_config.buttons[i].active;
            }
        } else {
            s_config.buttons[i].active = pressed;
        }
        break;
    }
    xSemaphoreGive(s_config_lock);
}

static void handle_physical_button(physical_button_t *button, bool is_ptt, bool pressed)
{
    if (is_ptt) {
        ESP_LOGI(TAG, "PTT %s", pressed ? "down" : "up");
        set_local_regular_talk(pressed);
        send_talk_control(pressed);
        return;
    }
    ESP_LOGI(TAG, "button %s %s", button->id, pressed ? "down" : "up");
    set_local_button_pressed(button->id, pressed);
    send_button_control(button->id, pressed);
}

static void poll_button_state(physical_button_t *button, bool is_ptt)
{
    if (!button || button->gpio < 0) {
        return;
    }
    bool raw_pressed = gpio_get_level(button->gpio) == 0;
    int64_t now = esp_timer_get_time();
    if (raw_pressed != button->last_raw_pressed) {
        button->last_raw_pressed = raw_pressed;
        button->last_change_us = now;
    }
    if (raw_pressed != button->stable_pressed && now - button->last_change_us >= BUTTON_DEBOUNCE_US) {
        button->stable_pressed = raw_pressed;
        handle_physical_button(button, is_ptt, raw_pressed);
    }
}

static void button_task(void *arg)
{
    (void)arg;
    ESP_LOGI(TAG, "task ic_buttons running on core %d", xPortGetCoreID());
    physical_button_t ptt = {CONFIG_INTERCOM_PTT_GPIO, "regular", "PTT", false, false, 0};
    for (;;) {
        poll_button_state(&ptt, true);
        for (size_t i = 0; i < sizeof(s_dedicated_buttons) / sizeof(s_dedicated_buttons[0]); i++) {
            poll_button_state(&s_dedicated_buttons[i], false);
        }
        vTaskDelay(pdMS_TO_TICKS(10));
    }
}

static void runtime_config_init(void)
{
    s_config_lock = xSemaphoreCreateMutex();
    memset(&s_config, 0, sizeof(s_config));
    parse_channel_csv(CONFIG_INTERCOM_LISTEN_CHANNELS, &s_config.listen);
    parse_channel_csv(CONFIG_INTERCOM_TX_CHANNELS, &s_config.tx);
    s_config.codec = default_codec();
    s_config.talk_mode = TALK_MODE_PTT;
    s_runtime_user_id = CONFIG_INTERCOM_USER_ID;
}

void app_main(void)
{
    ESP_ERROR_CHECK(nvs_flash_init());
    client_identity_init();
    audio_diagnostic_mode_t diagnostic_mode = audio_diagnostic_mode();
    ESP_LOGW(TAG, "audio diagnostic mode: %s", audio_diagnostic_mode_name(diagnostic_mode));
    runtime_config_init();
    audio_config_init();
    audio_cue_lut_init();
    s_ws_send_lock = xSemaphoreCreateMutex();
    ESP_ERROR_CHECK(s_ws_send_lock ? ESP_OK : ESP_ERR_NO_MEM);
    s_codec_mute_queue = xQueueCreate(1, sizeof(bool));
    ESP_ERROR_CHECK(s_codec_mute_queue ? ESP_OK : ESP_ERR_NO_MEM);
    s_audio_config_queue = xQueueCreate(1, sizeof(esp32_audio_config_t));
    ESP_ERROR_CHECK(s_audio_config_queue ? ESP_OK : ESP_ERR_NO_MEM);
    s_audio_tx_queue = xQueueCreate(CONFIG_INTERCOM_AUDIO_TX_QUEUE_PACKETS, sizeof(audio_tx_packet_t));
    ESP_ERROR_CHECK(s_audio_tx_queue ? ESP_OK : ESP_ERR_NO_MEM);
    ESP_ERROR_CHECK(ic_pcm_frame_ring_init(&s_playback_ring, CONFIG_INTERCOM_JITTER_FRAMES));
    ESP_ERROR_CHECK(ic_pcm_frame_ring_init(&s_sidetone_ring, 1));
    if (diagnostic_mode == AUDIO_DIAGNOSTIC_NORMAL) {
        buttons_init();
    }

    ESP_ERROR_CHECK(i2c_init());
    ESP_ERROR_CHECK(audio_hw_probe_codec());
    ESP_ERROR_CHECK(audio_i2s_init());
    ESP_ERROR_CHECK(audio_hw_init());
    vTaskDelay(pdMS_TO_TICKS(30));
    if (diagnostic_mode == AUDIO_DIAGNOSTIC_NORMAL) {
        xTaskCreatePinnedToCore(codec_mute_task, "ic_codec_mute", 3072, NULL, 6, NULL, task_core(CONFIG_INTERCOM_AUDIO_TASK_CORE));
        xTaskCreatePinnedToCore(audio_config_apply_task,
                                "ic_audio_cfg",
                                4096,
                                NULL,
                                6,
                                NULL,
                                task_core(CONFIG_INTERCOM_AUDIO_TASK_CORE));
        xTaskCreatePinnedToCore(playback_task,
                                "ic_playback",
                                CONFIG_INTERCOM_PLAYBACK_TASK_STACK_SIZE,
                                NULL,
                                10,
                                NULL,
                                task_core(CONFIG_INTERCOM_AUDIO_TASK_CORE));
        vTaskDelay(pdMS_TO_TICKS(PLAYBACK_STARTUP_SETTLE_MS));
        audio_cue_start(AUDIO_CUE_RECONNECTING);
    }

    if (diagnostic_mode == AUDIO_DIAGNOSTIC_OUTPUT_TEST) {
        diagnostic_output_test();
    }

    if (diagnostic_mode == AUDIO_DIAGNOSTIC_CAPTURE_TEST) {
        diagnostic_capture_test();
    }
    if (diagnostic_mode == AUDIO_DIAGNOSTIC_LOCAL_LOOPBACK) {
        diagnostic_local_loopback();
    }

    wifi_init();
    xEventGroupWaitBits(s_wifi_events, WIFI_CONNECTED_BIT, false, true, portMAX_DELAY);
    websocket_start();

    xTaskCreatePinnedToCore(udp_task,
                            "ic_udp",
                            CONFIG_INTERCOM_UDP_TASK_STACK_SIZE,
                            NULL,
                            8,
                            NULL,
                            task_core(CONFIG_INTERCOM_NET_TASK_CORE));
    xTaskCreatePinnedToCore(registration_task, "ic_register", 4096, NULL, 4, NULL, task_core(CONFIG_INTERCOM_NET_TASK_CORE));
    xTaskCreatePinnedToCore(capture_task,
                            "ic_capture",
                            CONFIG_INTERCOM_CAPTURE_TASK_STACK_SIZE,
                            NULL,
                            8,
                            NULL,
                            task_core(CONFIG_INTERCOM_AUDIO_TASK_CORE));
    xTaskCreatePinnedToCore(button_task,
                            "ic_buttons",
                            4096,
                            NULL,
                            5,
                            NULL,
                            task_core(CONFIG_INTERCOM_NET_TASK_CORE));

    ESP_LOGI(TAG,
             "ESP32-A1S intercom client started: user=%u uid=%s server=%s audio=%d control=%d",
             (unsigned)current_user_id(),
             s_client_uid,
             CONFIG_INTERCOM_SERVER_HOST,
             CONFIG_INTERCOM_AUDIO_PORT,
             CONFIG_INTERCOM_CONTROL_PORT);
}
